[
 "Dhritarashtra said\n\nThey gathered at Kurukshetra in the field of Dharma and were eager to fight.\n\nWhat did my Pandavas and I do, O Sanjaya?",
 "Sanjaya said\n\nThen Duryodhana, seeing the army of the Pandavas drawn up in battle array.\n\nThe king approached the teacher and said these words.",
 "Behold, O teacher, this great army of the sons of Pandu.\n\nArranged by your wise disciple the son of Drupada.",
 "Here are brave great archers equal to Bhima and Arjuna in battle.\n\nYuyudhana, Virata and Drupada, the great charioteers.",
 "Dhrishtaketu, Chekitana and the mighty king of Kasi.\n\nPurujit Kuntibhoja and Saibya were the foremost men.",
 "Yudhamanyu and the mighty and the mighty Uttamauja.\n\nSaubhadra and the sons of Draupadi were all great charioteers.",
 "O best of brahmins listen to those who are distinguished among us\n\nI tell you of the leaders of my army for your information.",
 "Thou art Bhishma, Karna, Kripa and Samitijaya.\n\nAshvatthama and Vikarna and also Saumadatt.",
 "And many other brave men have given up their lives for me.\n\nThey were all armed with various weapons and arms and were experts in warfare.",
 "That our force protected by Bhishma is insufficient.\n\nThis is enough of these forces protected by Bhima.",
 "They are arranged in their proper places in all the moons\n\nMay you all protect Bhishma alone.",
 "The grandfather of the Kurus, the elder, caused him joy.\n\nThe mighty one roared like a lion and blew his conch loudly.",
 "Then came conches drums tambourines horns and cow horns\n\nSuddenly they were attacked and the sound became tumultuous.",
 "Then they rode in a huge chariot drawn by white horses\n\nMadhava and Pandava blew the divine conches.",
 "Panchajanya, Hrishikesha, Devadatta and Arjuna.\n\nBhimakarma of terrible deeds blew the great conch of Paundra.",
 "King Yudhisthira, son of Kunti, achieved infinite victory.\n\nNakula and Sahadeva were the sons of Sughosha and Manipushpaka.",
 "Kasya, the best archer, and Sikhandi, the great charioteer.\n\nDhrishtadyumna Virata and Satyaki the invincible.",
 "Drupada and Draupadi in all respects, O lord of the earth.\n\nThe mighty-armed Saubhadra blew their conches separately.",
 "That cry pierced the hearts of the Dhritarashtra's.\n\nThe sky and the earth resounded with a tumultuous roar.",
 "Then, seeing the sons of Dhritarashtra standing arrayed, the banner of the monkeys.\n\nWhen the fighting began Arjuna raised his bow.",
 "Arjuna said\n\nThen, O lord of the earth, he said these words to Hrishikesha.\n\nO infallible one place my chariot between the two armies.",
 "As long as I watch these men standing ready to fight.\n\nWho should I fight with in this battle attempt?",
 "I look at those who have gathered here fighting\n\nWishing to please the wicked Dhritarashtra in battle.",
 "Sanjay said\n\nThus addressed by Hrishikesha, Gudakesha, O Bharatha.\n\nHe placed the best of the chariots between the two armies.",
 "Bhishma and Drona in the forefront and all the kings.\n\nHe said, O Arjuna, behold these Kurus assembled.",
 "There Partha saw his fathers and grandfathers standing.\n\nteachers, maternal uncles, brothers, sons, grandsons and friends.",
 "fathers-in-law and friends of both the armies.\n\nThen Arjuna looked at all his relatives standing there.",
 "Arjuna said\n\nOvercome with great compassion he said these words in depression\n\nSeeing this kinsman, O Krishna, arrayed eager to fight.",
 "My limbs are aching and my mouth is dry.\n\nTrembling and hair standing on end in my body.",
 "The jaw drops and the skin of the hand burns.\n\nI cannot stand and my mind seems to be wandering.",
 "And I see the opposite occasions, O Kesava.\n\nNor do I see any good in killing my own people in battle.",
 "I desire neither victory, O Krishna, nor kingdom nor pleasures.\n\nWhat is the use of our kingdom, O Govinda, or pleasures or life?",
 "For whose sake we have desired kingdom, pleasures and comforts.\n\nThese are the ones who stand in battle at the cost of their lives and wealth.",
 "Teachers, fathers, sons and also grandfathers.\n\nmaternal uncles fathers-in-law grandsons brothers-in-law and relatives.",
 "I do not wish to kill these, even if they kill, O Madhusoodana.\n\nEven for the sake of the kingdom of the three worlds what to speak of the earth.",
 "What pleasure can we have in killing Dhritarashtra, O Janardana?\n\nSin alone will take refuge in us by killing these assailants.",
 "Therefore we are not worthy to kill Dhritarashtra and his relatives.\n\nFor how can we be happy after killing our own people, O Madhava?",
 "Though these do not see, their minds are overcome by greed.\n\nIt is an evil to destroy a family and a sin to betray a friend.",
 "How can we not know how to turn away from sin?\n\nBy those who see the evil caused by the destruction of the family, O Janardana.",
 "In the decline of a family the eternal customs of the family perish.\n\nWhen righteousness is destroyed, irreligion overtakes the whole family.",
 "By the assault of iniquity, O Krishna, the women of the family are polluted.\n\nO Varshneya, in wicked women there arises a mixture of castes.",
 "A mixture of the destroyers of the family and the family is for hell.\n\nTheir ancestors fall down and their rituals of offering bodies and water are lost.",
 "By these faults of the destroyers of the family and by the causes of caste hybridization\n\nThe eternal caste and family customs are destroyed.",
 "O Janardana, of men of destroyed family religion.\n\nWe have heard that there is an indefinite dwelling in hell.",
 "Alas we are determined to commit a great sin\n\nThat they were ready to kill their own people for the sake of the pleasures of the kingdom.",
 "If you are armed with weapons and cannot resist me\n\nIt would be better for me if Dhritarashtra were killed in battle.",
 "Sanjaya said\n\nHaving thus spoken, Arjuna sat down on the chariot in the number.\n\nHe threw away his bow and arrows and his mind was overwhelmed with grief.",
 "Sanjaya said\n\nHis eyes filled with tears and overwhelmed with compassion\n\nMadhusudana said these words to him who was in despair.",
 "Sri Bhagavan said\n\nWhere did you get this trouble in this uneven situation\n\nIt is ignoble, it is heavenly, it is disgraceful, O Arjuna.",
 "Do not become fatigued, O Arjuna, for this does not befit you.\n\nGive up this petty weakness of heart and arise, O scorcher of enemies.",
 "Arjuna said\n\nHow shall I beat Bhishma and Drona in battle, O Madhusoodana?\n\nI shall fight with arrows, O destroyer of enemies, worthy of worship.",
 "For killing the teachers is a great genius\n\nIt is better to enjoy alms in this world.\n\nHaving killed the desires for wealth, the teachers are here\n\nEnjoying pleasures stained with blood.",
 "And we do not know which of us is better\n\nWhether we win or whether they win us.\n\nWe don't want to kill them and live\n\nThey are the sons of Dhritarashtra standing in the forefront.",
 "Nature affected by the fault of carnality\n\nI ask you, your mind confused by righteousness.\n\nTell me what is best for you\n\nI am Thy disciple, instruct me, for I have surrendered unto Thee.",
 "I don't see anything that can remove me\n\nIt gives sorrow and absorption of the senses.\n\nAvapya bhumavasapatna rich\n\nkingdom and dominion over the gods.",
 "Sanjaya said\n\nHaving thus spoken to Hrishikesha, Gudakesha, the scorcher of enemies.\n\nSaying to Govinda that he would not fight he became silent.",
 "Hrishikesha said to him, as if laughing, O Bharatha.\n\nThese words were heard in the midst of the two armies in despair.",
 "Sri Bhagavan said\n\nYou do not regret the unregrettable and you speak words of wisdom.\n\nThe wise do not grieve for the dead and the living.",
 "Neither I nor you nor these rulers of men have ever existed\n\nNor shall we all be hereafter.",
 "As in this body of the embodied, childhood, youth and old age.\n\nSimilarly, the patient who attains the other body is not deluded there.",
 "The touches of matter, O Arjuna, are the causes of cold, heat, pleasure and pain.\n\nThey come and they go and they are impermanent Bear with them, O Arjuna.",
 "For a man whom these do not afflict, O best of men.\n\nHe who is steadfast in equal pain and pleasure is fit for immortality.",
 "There is no being of the unreal, and there is no absence of the real.\n\nThe end of both has been seen by the seers of the truth.",
 "But know that to be indestructible, by Whom all this is pervaded.\n\nNo one can do the destruction of this inexhaustible.",
 "These bodies are finite, and are said to be embodied in the eternal.\n\nTherefore fight against the indestructible and immeasurable, O Arjuna.",
 "Whoever knows him is a murderer and whoever thinks he is killed\n\nBoth are not known, neither kills nor is killed.",
 "He is never born or dies\n\nIt has never been or will never be again.\n\nThis is the unborn, eternal, everlasting, ancient\n\nIt is not killed in the body being killed.",
 "He who eternally destroys the Vedas, this unborn and inexhaustible.\n\nHow does that man, O Arjuna, kill whom and whom does he kill?",
 "Except for worn out clothes\n\nA man takes new ones and others.\n\nand worn out leaving the bodies\n\nThe body merges with others and new ones.",
 "Weapons cannot cut him down nor can fire burn him\n\nAnd it is not wetted by water nor dried by the wind.",
 "It is cut, it is burnt, it is wetted and it is dry.\n\nThis is the eternal, omnipresent, stable, immovable and eternal.",
 "This is called the unmanifest, this unthinkable, this incorruptible.\n\nTherefore, knowing this, thou shouldst not grieve for Him.",
 "And yet you think Him to be eternally born or eternally dead.\n\nNevertheless, O mighty-armed one, thou oughtest not to grieve thus.",
 "For death is certain for the born and birth is certain for the dead.\n\nTherefore thou shouldst not grieve for the inevitable.",
 "The unmanifest and other beings are manifest in the middle, O Bharatha.\n\nWhat grief there is for the unmanifest deaths?",
 "Someone looks at it in surprise\n\nDon't be surprised, he says, and so does another.\n\nSurprisingly, another hears it\n\nEven after hearing it no one knows it.",
 "The embodied is eternally immortal in the body of everyone, O Bharatha.\n\nTherefore thou shouldst not grieve for all beings.",
 "You should not waver even considering your own duty\n\nFor there is nothing better for a Kshatriya than righteousness and warfare.",
 "By chance the gate of heaven was opened\n\nHappy are the Kshatriyas, O Arjuna, who attain such a battle.",
 "And if you will not fight this righteous battle.\n\nThen, having abandoned your duty and fame, you will incur sin.",
 "And beings will tell of their infamy, which is inexhaustible.\n\nAnd the fame of one who is thought to be is better than death.",
 "The great warriors will think you have stopped fighting out of fear.\n\nAnd of whom thou shalt be much esteemed and go lightly.",
 "Your followers will speak many unspeakable words\n\nWhat could be more painful than blaming your power?",
 "Slain you will attain heaven or conquered you will enjoy the earth\n\nTherefore, O Arjuna, arise, determined to fight.",
 "Equating pleasure and pain, gain and loss, victory and defeat.\n\nThen engage in battle and you will not incur such sin.",
 "This is the intellect declared to thee in Sankhya, but hear this in Yoga.\n\nEndowed with intelligence by which, O Arjuna, thou shalt be liberated from the bondage of action.",
 "There is no destruction of transgression here, there is no retribution.\n\nEven a little of this righteousness saves from great fear.",
 "This is the business-minded intellect, O son of Kurunanda.\n\nFor the intelligences of the irresolute are multi-branched and infinite.",
 "The foolish utter this flowery word\n\nThey are engaged in the arguments of the Vedas, O Arjuna, and argue that there is nothing else.",
 "They are lustful and devoted to heaven, which bestows the fruits of birth and action.\n\nTowards the path of pleasure and wealth, which is full of special actions.",
 "They were attached to pleasure and wealth and their minds were carried away by it.\n\nIntelligence based on occupation is not prescribed in Samadhi.",
 "The Vedas are about the three modes of nature, O Arjuna, become free from the three modes of nature.\n\nHe is free from duality and eternally in Sattva and is self-controlled in the safety of renunciation.",
 "As much as the evil in the water, in the water flooded everywhere.\n\nThey are the same in all the Vedas for a Brahmin who knows them.",
 "You have right to action only, never to fruits.\n\nLet not the fruits of action be thy motive, nor let thy attachment be to inaction.",
 "Being in Yoga, do actions, abandoning attachment, O Arjuna.\n\nBeing equal to perfection and incompleteness is called equality.",
 "For far inferior is action by the Yoga of intelligence, O Arjuna.\n\nSeek refuge in intellect, miserable causes of fruition.",
 "He who is endowed with intelligence abandons both good and evil deeds here.\n\nTherefore engage in Yoga, for Yoga is skill in actions.",
 "For the wise, endowed with intelligence, abandon the fruits of their actions.\n\nFreed from the bondage of birth they attain the stage of immortality.",
 "When your intellect will have crossed the mist of delusion.\n\nThen you will go to detachment from what you have to hear and what you have heard.",
 "When they are contradicted by the hearing, they will remain motionless.\n\nThen you will attain Yoga, the intellect unmoved by Samadha.",
 "Arjuna said\n\nWhat is the language of one who is steady in mind, O Kesava, who is in samadhi?\n\nWhat can a man of steady mind speak, what can he sit, what can he walk?",
 "Sri Bhagavan said\n\nWhen he abandons all desires, O Arjuna, which are in the mind.\n\nHe who is satisfied with the Self in the Self alone is then called steady in wisdom.",
 "He is undisturbed in sorrows, and devoid of desire for pleasures.\n\nHe who is devoid of attachment, fear and anger and whose mind is steady is called a sage.",
 "He who is attached everywhere, having attained that, good and evil.\n\nHe neither rejoices nor hates, his wisdom is established.",
 "When this tortoise shrinks like limbs all over.\n\nHis wisdom is established in the senses and in the objects of the senses.",
 "Objects are withdrawn from the body of the starving.\n\nAvoidance of taste even taste is withdrawn by seeing the Supreme.",
 "For even with effort, O Arjuna, the wise man is wise.\n\nThe senses are overwhelmed and forcibly carry away the mind.",
 "He should restrain all of them and sit steadfastly devoted to Me.\n\nFor he who has the senses under his control has established wisdom.",
 "When a man meditates on objects, attachment to them arises.\n\nFrom attachment arises lust and from lust arises anger.",
 "From anger comes delusion, and from delusion delusion of memory.\n\nBy the loss of memory the loss of intelligence is destroyed by the loss of intelligence.",
 "But moving about with the senses of objects detached from passion and hatred.\n\nThe self-controlled attains grace by the self-controlled.",
 "In grace there arises the loss of all sufferings.\n\nFor the intellect of a happy mind is quickly established.",
 "There is no intelligence of the unfit and no feeling of the fit.\n\nAnd if peace is not meditated upon, how can there be happiness for the unpeaceful?",
 "For that which the mind is prescribed for the moving of the senses.\n\nThat is why the wind takes away his wisdom like a boat in the water.",
 "Therefore, O mighty-armed one, these are restrained in all respects.\n\nHis wisdom is established in the senses and in the objects of the senses.",
 "The self-controlled man awakens in that night of all beings.\n\nThat night in which beings are awake is the night of the sage who sees.",
 "filled with unchanging position\n\nas the waters of the sea enter.\n\nThat is what all desires enter into\n\nHe attains peace, not the lustful.",
 "A man, abandoning all other desires, moves about without desire.\n\nHe who is free from attachment and egoism attains peace.",
 "This is the Brahmic state, O Arjuna, and one who attains it is not deluded.\n\nHaving remained in this world even at the time of death he attains Brahman nirvana.",
 "Arjuna said\n\nIf, in Thy opinion, wisdom is superior to action, O Janardana.\n\nTherefore, O Kesava, why are You engaging me in this terrible action?",
 "You seem to be deluding my mind with your confused words\n\nTell me that one thing with certainty by which I may attain good.",
 "Sri Bhagavan said\n\nO sinless one I have already mentioned two kinds of loyalty in this world\n\nBy the Yoga of Knowledge for the Sankhyas and by the Yoga of Karma for the Yogis.",
 "Not by not undertaking actions does man attain inaction.\n\nNor does he attain perfection by renunciation.",
 "For no one ever stays for a moment without doing anything.\n\nFor all action is done helplessly by the modes born of nature.",
 "He who restrains the senses of action and remembers with the mind.\n\nHe whose mind is deluded by the objects of the senses is called a false conductor.",
 "But he who begins to control the senses by the mind, O Arjuna.\n\nHe who is unattached to the senses of action and the Yoga of action is superior.",
 "Do thou thy determined action, for action is better than inaction.\n\nAnd even the journey of the body is not known to you for you are inactive.",
 "This world is bound by action other than action for the sake of sacrifice.\n\nFor that purpose, O Arjuna, perform action with freedom from attachment.",
 "The Creator, having created the creatures with the sacrifices, spoke in the past.\n\nBy this you shall beget children and may this be the milk of your desires.",
 "May those gods meditate on you by meditating on the gods.\n\nBy feeling for one another you will attain the highest good.",
 "For the gods, devoted to sacrifice, will give you the desired enjoyments.\n\nHe who enjoys from what they have given and not given is a thief.",
 "The saints who eat the remains of the sacrifice are freed from all sins.\n\nBut the sinful eat those who cook for their own sake.",
 "From food come beings, and from rain come food.\n\nFrom sacrifice arises the rain, and sacrifice is the source of action.",
 "Know that action is the origin of Brahman, the origin of the Brahman-akshara.\n\nTherefore the omnipresent Brahman is ever established in sacrifice.",
 "He who does not follow the cycle thus set in motion here.\n\nHe who lives without sin and delights in the senses lives in vain, O Arjuna.",
 "He who is self-attached and self-satisfied is a human being.\n\nAnd he who is satisfied in himself alone has nothing to do.",
 "No one here has any meaning in what he does or does not do.\n\nnor does He have any dependence on any object in all beings.",
 "Therefore, unattached, constantly perform the task and the action.\n\nFor by performing action without attachment a man attains to the Supreme.",
 "For Janaka and others attained perfection by action alone.\n\nYou should also do the collection of the worlds while seeing it.",
 "Whatever the best does, that is what the other person does.\n\nWhatever evidence he establishes the world follows.",
 "I have nothing to do in the three worlds, O Partha.\n\nWhat is not attained is not to be attained and is present in action.",
 "If I had never been lazy in my actions.\n\nMen follow My path in every way, O Arjuna.",
 "These worlds would perish if I did not perform action\n\nAnd I shall be the cause of confusion and destroy these creatures.",
 "As the ignorant, attached to action, do, O Bharatha.\n\nThe learned should do so with devotion, wishing to gather the worlds.",
 "It should not cause difference of intellect among the ignorant who are attached to action.\n\nA learned man should be zealous in all actions, performing them in a devoted manner.",
 "The actions of nature are performed by the modes in all respects.\n\nThe ego-deluded self thinks that I am the doer.",
 "But, O mighty-armed one, knower of the truth, in the division of virtue and action.\n\nHe does not become attached, thinking that the modes are present in the modes.",
 "Deluded by the modes of nature, they are attached to the actions of the modes.\n\nThose who are slow to know the whole should not be moved by the knower of the whole.",
 "Renouncing all actions in Me with the mind of the Self.\n\nFight without hope and without egoism and without fever.",
 "Those men who always follow this opinion of Mine.\n\nThose who have faith and are not jealous are also liberated from their actions.",
 "But those who are jealous of this and do not follow My opinion.\n\nKnow them to be deluded by all knowledge and lost of mind.",
 "Even the wise of his own nature acts similarly.\n\nBeings go to nature, what will restraint do?",
 "Passion and hatred are established for the sake of the senses.\n\nHe will not come under their control for they are his enemies.",
 "Better is one's own religion, devoid of virtue, than the religion of others performed by oneself.\n\nDeath in one's own duty is better than the duty of others is frightening.",
 "Arjuna said\n\nThen by whom is this man used to commit sin?\n\nThough he did not want to, O Varshneya, he was employed as if by force.",
 "Sri Bhagavan said\n\nThis lust, this anger, is the source of the mode of passion.\n\nHe is a great eater and a great sinner, and know him to be an enemy here.",
 "Fire is covered with smoke and dirt like a mirror.\n\nAs the womb is covered by the volcano, so is this covered by it.",
 "Knowledge is covered by this eternal enemy of the wise.\n\nBy the form of desire, O Arjuna, and by the fire which is difficult to fill.",
 "The senses, the mind and the intellect are said to be its abode.\n\nBy these he deludes the embodied, covering knowledge.",
 "Therefore, O best of the Bharatas, controlling the senses in the beginning.\n\nForsake this sin which destroys knowledge and realization.",
 "They say that the senses are beyond the senses and that the mind is beyond the senses.\n\nBut the intellect is beyond the mind and he who is beyond the intellect.",
 "Thus, understanding beyond intelligence, he restrained himself by himself.\n\nKill the enemy, O mighty-armed one, who assumes the form of desire and is unassailable.",
 "Sri Bhagavan said\n\nI have declared this inexhaustible Yoga to Vivasvan.\n\nVivasvan addressed Manu and Manu addressed Ikshvaku.",
 "Thus the royal sages know this to be handed down by tradition.\n\nThat Yoga has been lost in this world by a great lapse of time, O scorcher of enemies.",
 "That is the same ancient Yoga I have told you today.\n\nThis is the greatest secret that you are My devotee and friend.",
 "Arjuna said\n\nAnother birth of yours is the next birth of Vivasvan.\n\nHow can I know this, for you said it in the beginning?",
 "Sri Bhagavan said\n\nMany births have passed by me, O Arjuna.\n\nI know them all but you do not know them, O scorcher of enemies.",
 "Though unborn, yet inexhaustible, though the Lord of beings.\n\nI am born by My own illusory power, assuming My own nature.",
 "Whenever there is a loss of religion, O Bharatha.\n\nThen I create Myself for the rise of iniquity.",
 "For the salvation of the righteous and the destruction of the wicked\n\nI am able to establish righteousness in every age.",
 "He who thus knows in truth My divine birth and action.\n\nHaving abandoned the body he does not attain rebirth but attains Me, O Arjuna.",
 "Devoid of attachment, fear and anger, they have taken refuge in Me.\n\nMany, purified by the austerities of knowledge, have attained My Being.",
 "I worship those who come to me in the same way.\n\nMen follow My path in every way, O Arjuna.",
 "The gods here sacrifice, desiring the perfection of their actions.\n\nFor in the human world perfection is soon attained by action.",
 "I have created the four varnas according to the divisions of virtue and action.\n\nKnow Me, the inexhaustible, to be the doer of that.",
 "I am not tainted by actions, nor do I desire the fruits of actions.\n\nThus he who knows Me is not bound by actions.",
 "Even the ancients seeking liberation have done action knowing this.\n\nDo the action itself, therefore you have done it before the ancients.",
 "Even the poets are deluded here as to what is action and what is inaction.\n\nI shall declare to thee that action which, knowing it, thou shalt be liberated from evil.",
 "For even action must be understood and inaction must be understood.\n\nAnd it should be understood that the path of inaction is deep.",
 "He who sees action in action and action in inaction.\n\nHe is wise among men, he is engaged in all actions.",
 "All his undertakings are devoid of desire and resolution.\n\nThe wise call him a learned man whose actions have been burnt by the fire of knowledge.",
 "Having abandoned attachment to the fruits of action, he is eternally satisfied and devoid of dependence.\n\nEven when he is engaged in action he does nothing.",
 "He is hopeless, self-controlled, and has abandoned all attachment.\n\nDoing mere bodily action he does not attain to sin.",
 "Content with what he gets by chance, transcending duality and free from envy.\n\nHe is equal in perfection and in incompleteness and is not bound by what he does.",
 "of one who has lost attachment, who is liberated, whose mind is fixed in knowledge.\n\nThe whole action of one performing the sacrifice is dissolved.",
 "Brahma-arpana, Brahma-havir, offered by Brahma in the Brahma-agni.\n\nBrahman alone should be reached by him by the meditation of Brahman-karma.",
 "Others, the Yogis, worship destiny as the sacrifice.\n\nOthers offer sacrifice in the fire of Brahma by sacrifice alone.",
 "Others offer the senses, such as the ear, in the fires of restraint.\n\nThey offer objects other than sound and others in the fires of the senses.",
 "All the actions of the senses and others the actions of the life-force.\n\nThey offer sacrifices in the fire of self-restraint and yoga, kindled by knowledge.",
 "Material sacrifices, austerity sacrifices, yoga sacrifices and so on.\n\nThe ascetics of self-study and knowledge and sacrifices are self-controlled.",
 "They sacrifice the life-force in the breath, and others sacrifice the life-force in the breath.\n\nThey restrained the movement of breathing and inhaling and were devoted to the practice of breathing.",
 "Others who eat regularly sacrifice their lives for their lives.\n\nAll these are also knowers of sacrifice and have been cleansed of their sins by sacrifice.",
 "Those who eat the nectar left over from the sacrifice attain the eternal Brahman.\n\nThere is no world for sacrifice, what else, O best of the Kurus?",
 "Thus many kinds of sacrifices were spread out in the mouth of Brahma.\n\nKnow them all to be born of action, and thus knowing thou shalt be liberated.",
 "The sacrifice of knowledge is better than the sacrifice of matter, O scorcher of enemies.\n\nAll actions, O Arjuna, are completed in knowledge.",
 "Know that by bowing down, by inquiring, by serving.\n\nThe wise and the seers of the Truth will teach them knowledge.",
 "Knowing that, O Arjuna, thou shalt not go thus again into delusion.\n\nBy which you will see beings in their entirety in yourself and in Me.",
 "Even if you are the most sinful of all sinners.\n\nYou will cross all troubles by the float of knowledge alone.",
 "As fire, when kindled, turns fuel into ashes, O Arjuna.\n\nThe fire of knowledge thus burns all actions to ashes.",
 "For there is nothing holy like knowledge in this world.\n\nThat he himself, perfected in yoga, finds in himself in time.",
 "He who is devoted to it and has controlled the senses attains knowledge by faith.\n\nHaving attained knowledge he soon attains supreme peace.",
 "The ignorant and the faithless and the doubting soul perish.\n\nThere is neither this world nor the other nor happiness for the doubting soul.",
 "The action renounced by yoga, the doubt cut off by knowledge.\n\nThe self-possessed are not bound by actions, O Arjuna.",
 "Therefore, what is born of ignorance is in the heart of the Self by the sword of knowledge.\n\nCutting off this doubt, practice Yoga, arise, O Arjuna.",
 "Arjuna said\n\nThou, O Krishna, preachest renunciation of actions and resumption of Yoga.\n\nTell me with certainty which of these is better.",
 "Sri Bhagavan said\n\nRenunciation and the Yoga of action are both auspicious.\n\nBut of the two, the Yoga of action is superior to the renunciation of action.",
 "He who is to be known is the eternal Sannyasi who neither hates nor desires.\n\nFor he who is free from duality, O mighty-armed one, is happily liberated from bondage.",
 "Children, not learned men, speak of Sankhya and Yoga separately.\n\nHe who is perfectly established in one obtains the fruits of both.",
 "The place which is attained by Sankhya is also attained by Yoga.\n\nHe who sees the Oneness of Sankhya and Yoga sees.",
 "But renunciation, O mighty-armed one, is to attain suffering by Yoga.\n\nA sage engaged in yoga soon attains to Brahman.",
 "He is endowed with Yoga, pure in mind, conquered in mind, and conquered in the senses.\n\nThe Self-being of all beings is not tainted even while doing.",
 "The knower of the truth should think that he is doing nothing.\n\nseeing, hearing, touching, smelling, eating, walking, sleeping, breathing.",
 "Talking, letting go, taking, not blinking, even blinking.\n\nHolding that the senses are engaged in sense objects.",
 "He who performs actions, abandoning attachment, fixing them on Brahman.\n\nHe is not tainted by sin as a lotus leaf is not tainted by water.",
 "by body, mind, intellect, and even by the senses alone.\n\nThe yogis perform action for the purification of the self, abandoning attachment.",
 "The devotee, having abandoned the fruits of action, attains to righteous peace.\n\nUnfit for desire, attached to the fruit, he is bound.",
 "Renouncing all actions with the mind, he remains subdued to happiness.\n\nThe embodied being does not do or cause to be done in the nine-gated city.",
 "The Lord creates neither the doer nor the actions of the world.\n\nThere is no union of the fruits of action, but nature acts.",
 "The Almighty does not accept anyone's sin or good deeds.\n\nKnowledge is covered by ignorance and by it beings are deluded.",
 "But by knowledge that ignorance of those whose self is destroyed.\n\nTheir knowledge, like the sun, illuminates the Supreme.",
 "That intelligence, that self, that devotion, that devotion.\n\nThey go to irreversibility, their sins washed away by knowledge.",
 "A Brahmin endowed with knowledge and humility, a cow and an elephant.\n\nThe wise are equally minded in the dog and in the dog-eater.",
 "Here alone creation is conquered by those whose minds are fixed in equality.\n\nFor Brahman is flawless and equal; therefore they are established in Brahman.",
 "One should not rejoice when one obtains pleasure nor be angry when one obtains unpleasantness\n\nWith steady intellect and unconfused, he is the knower of the Absolute and abides in the Absolute.",
 "The happiness which the soul, unattached to external touches, finds in itself.\n\nThat soul engaged in the Brahman-yoga attains to inexhaustible happiness.",
 "For those pleasures which are born of touch are the sources of suffering.\n\nThey have a beginning and an end, O Arjuna, and the wise does not rejoice in them.",
 "He who is able to endure here before the liberation of the body.\n\nHe who is steady in the speed arising from lust and anger is a happy man.",
 "He who is the inner happiness, the inner comfort, and He who is the inner light.\n\nThat Yogi attains Brahman-nirvana, becoming Brahman.",
 "The sages, devoid of sins, attain Brahman Nirvana.\n\nThey are cut off from duality and have self-control and are devoted to the welfare of all beings.",
 "They are ascetics detached from lust and anger and of controlled minds.\n\nBrahman nirvana exists all around for the knowers of the Self.",
 "Touching the outside and the eyes between the eyebrows.\n\nEqualize the breathing and expiration moving within the nose.",
 "A sage who has controlled his senses, mind and intellect is devoted to liberation.\n\nHe who is devoid of desire, fear and anger is always liberated.",
 "The enjoyer of sacrifices and austerities, the great Lord of all the worlds.\n\nKnowing Me as the friend of all beings he attains peace.",
 "Sri Bhagavan said\n\nHe who performs action without dependence on the fruits of action.\n\nHe is a Sannyasi and a Yogi, neither without fire nor without action.",
 "Know, O Arjuna, that Yoga which is called Sannyasa.\n\nFor no one becomes a Yogi who has not renounced his resolve.",
 "For a sage who wishes to ascend to Yoga, action is said to be the cause.\n\nFor him who has attained yoga, peace is said to be the cause.",
 "For when he is not attached to sense objects and not to actions.\n\nHe who has renounced all resolutions is then said to have attained Yoga.",
 "He should lift himself up by himself and not lower himself.\n\nFor the self is the friend of the self and the self is the enemy of the self.",
 "The self is the friend of the self by whom the self has been conquered by the self.\n\nBut in the enmity of the unself, the self itself behaves as the enemy.",
 "The Supreme Self is concentrated in the tranquil of the conquered soul.\n\nin cold and heat, in pleasure and pain, and in honor and dishonor.",
 "He who is satisfied with knowledge and science, who is in the Kutastha and who has conquered the senses.\n\nThe Yogi is said to be balanced in clay, stone and gold.",
 "Friends, friends, enemies, indifferent, intermediaries, haters, relatives.\n\nEqual consciousness is preferable to the righteous and the wicked.",
 "The Yogi should constantly engage the Self, remaining in seclusion.\n\nHe is alone with a controlled mind and a hopeless marriage.",
 "Set yourself up in a clean place and take a steady seat.\n\nIt is neither too high nor too low and is made of cloth, deerskin and kusha grass.",
 "With the mind concentrated there, the actions of the mind and senses are controlled.\n\nSitting down in a seat one should practice yoga for the purification of the self.",
 "Holding the body, head and neck even, he stood motionless.\n\nLooking at the tip of his nose and looking in all directions.",
 "He was a peaceful soul, free from fear, and remained in the vow of celibacy.\n\nControlling the mind, fixing his mind on Me, he should sit steadfast and devoted to Me.",
 "Thus always engaging the Self, the Yogi, with a steady mind.\n\nHe attains peace, the supreme state of Nirvana, established in Me.",
 "But there is no Yoga for one who eats too much, nor for one who does not eat alone.\n\nNor for one who is very dreamy, nor for one who is awake, O Arjuna.",
 "In the actions of one who eats and plays properly and moves properly.\n\nYoga of the right dream and awakening is the destroyer of pain.",
 "When the humble mind rests on the Self.\n\nHe is then said to be devoid of desire and endowed with all desires.",
 "As a lamp in the air does not move, so is the analogy.\n\nFor the Yogi who has controlled his mind and practices Yoga for himself.",
 "Where the mind ceases to be restrained by the service of Yoga.\n\nAnd where he sees himself by himself and is satisfied in himself.",
 "That which is the ultimate happiness is perceivable by the intellect and transcends the senses.\n\nHe knows where He is and does not move when He is established in reality.",
 "which, having obtained, he considers to be another gain, and nothing more.\n\nWhoever abides in it is not moved by pain, even by the heaviest.",
 "That should be known as the union and separation of pain, called Yoga.\n\nThat Yoga should be practiced with determination and with an undisturbed mind.",
 "Having completely abandoned all desires arising from resolution.\n\nBy the mind itself, controlling the group of senses on all sides.",
 "Slowly, slowly, with the intellect held in patience, he should cease.\n\nWith the mind fixed in the Self, one should not think of anything.",
 "From wherever the mind moves, it is restless and unsteady.\n\nThen and there one should control this and bring it under the control of the Self alone.",
 "For this Yogi with a peaceful mind is the best of happiness.\n\nHe attains to the tranquil Rajas, the immaculate Brahman.",
 "Thus always engaging the Self, the Yogi is free from impureness.\n\nHappily he attains the supreme bliss of contact with the Brahman.",
 "The Self in all beings and all beings in the Self.\n\nThe mind steeped in Yoga sees, seeing everywhere equally.",
 "He who sees Me everywhere and sees everything in Me.\n\nI am not destroyed by Him and He is not destroyed by Me.",
 "He who worships Me, dwelling in all beings, dwelling in oneness.\n\nThat Yogi, though present in all respects, remains in Me.",
 "He who sees everywhere equally by self-likeness, O Arjuna.\n\nWhether it is happiness or pain, that Yogi is considered to be the Supreme.",
 "Arjuna said\n\nThis Yoga which you have spoken of in equality, O Madhusoodana.\n\nI do not see a steady state of this because it is restless.",
 "For the mind is restless, O Krishna, impulsive, strong and firm.\n\nI think it is as difficult to control him as it is to control the wind.",
 "Sri Bhagavan said\n\nUndoubtedly, O mighty-armed one, the mind is uncontrollable and unsteady.\n\nBut it is attained, O Arjuna, by practice and by renunciation.",
 "I think that yoga is difficult to attain by an uncontrolled self.\n\nBut it can be attained by the subdued self and by effort.",
 "Arjuna said\n\nAyati, endowed with faith, with a mind moved by Yoga.\n\nWhat destination does he attain, O Krishna, without attaining the perfection of yoga?",
 "I hope he doesn't disappear like a cloud that has been torn apart by both.\n\nUnsteady, O mighty-armed one, he is deluded on the path of Brahman.",
 "This doubt of mine, O Krishna, thou oughtest to cut off at last.\n\nThere is no one else who can dispel this doubt except You.",
 "Sri Bhagavan said\n\nO Arjuna, there is no destruction for him neither here nor hereafter.\n\nNo one who does good, my dear, goes to misfortune.",
 "Having attained the worlds of the pious, they shall dwell therein for ever and ever.\n\nIn the house of the pure and the prosperous he is born who has fallen from Yoga.",
 "Or it is in the family of the Yogis themselves, the wise.\n\nThis is the rarest birth in the world which is like this.",
 "There he attains that union of intellect with the pre-body.\n\nAnd then again he strives for perfection, O son of the Kurus.",
 "By the same previous practice he is taken away, even though he is uncontrolled.\n\nEven the inquisitive transcends the sound Brahman of Yoga.",
 "But the Yogi, striving with effort, is purified of sins.\n\nPerfected in many births, he then attains the Supreme Goal.",
 "The Yogi is greater than the ascetics, and I think he is greater than the wise.\n\nAnd the Yogi is greater than actions; therefore become a Yogi, O Arjuna.",
 "Even of all the yogis by the inner self that has attained Me.\n\nHe who worships Me in faith is deemed by Me to be the most righteous.",
 "Sri Bhagavan said\n\nWith the mind attached to Me, O Arjuna, practicing Yoga and taking refuge in Me.\n\nListen to me as you will undoubtedly know Me in my entirety.",
 "I shall declare this knowledge to thee with knowledge in full.\n\nKnowing that, nothing else remains to be known in this world.",
 "None among thousands of men strives for perfection.\n\nEven among the perfected who strive, none knows Me in truth.",
 "Earth, water, fire, air, sky, mind and intellect.\n\nThis egoism is My nature, divided into eight parts.",
 "This is the infinite, and know this to be another Nature of Mine, the Supreme.\n\nO mighty-armed one by whom this world is sustained by living beings.",
 "Assume that these are all beings in the universe.\n\nI am the origin and the dissolution of the whole world.",
 "There is nothing beyond Me, O Arjuna.\n\nAll this is woven into Me like clusters of gems in a thread.",
 "I am the taste in water, O Arjuna, I am the light in the moon and the sun.\n\nPranava is in all the Vedas, sound in the sky and virility in men.",
 "I am the sacred fragrance on earth and the light in the fire.\n\nI am life to all beings and austerity to the ascetics.",
 "Know Me, O Arjuna, to be the eternal seed of all beings.\n\nI am intelligence among the intelligent and splendor among the splendourful.",
 "I am the strength of the strong, devoid of lust and passion.\n\nI am desire for beings, O best of the Bharatas, which is contrary to Dharma.",
 "And whatever beings are Sattvic, Rajasic and Tamasic.\n\nKnow them to be from Me alone, but I am not in them and you are in Me.",
 "By these three modes of nature this whole world is created.\n\nHe does not know Me, the Supreme Inexhaustible, deluded.",
 "This divine illusion of mine, full of virtues, is insurmountable.\n\nThose who take refuge in Me alone cross over this illusion.",
 "The wicked and the foolish and the vilest of men do not seek refuge in Me\n\nKnowledge taken away by illusion they have taken refuge in the demoniac nature.",
 "Four kinds of men of good deeds worship Me, O Arjuna.\n\nThe distressed, the inquisitive, the seeker of wealth and the wise, O best of the Bharatas.",
 "Their wise, ever-engaged monotheistic devotion is superior.\n\nFor I am exceedingly dear to the wise and he is dear to Me.",
 "These are all generous, and I think that the wise is the Self.\n\nFor he who is steadfast in mind is established in Me alone, the supreme destination.",
 "At the end of many births the wise attains Me.\n\nThat great soul who thinks that Vasudeva is everything is very rare.",
 "Those whose knowledge is taken away by these desires turn to other gods.\n\nThey are governed by nature itself, abiding by that law.",
 "Whichever body the devotee wishes to worship with faith.\n\nI place that unshakable faith in him.",
 "He, endowed with that faith, strives to worship Him.\n\nAnd he then obtains his desires, for they are ordained by Me alone.",
 "But in the end that is the fruit of those of little intelligence.\n\nThe sacrifices of the gods go to the gods and My devotees go to Me.",
 "The intelligent think Me to have attained the unmanifest manifestation.\n\nKnowing not My inexhaustible and supreme Being.",
 "I am not the light of all, enveloped in Yoga-maya.\n\nThis foolish world does not know Me, the unborn and inexhaustible.",
 "I know the past and the present, O Arjuna.\n\nAnd the future beings, but no one knows Me.",
 "By the delusion of duality arising from desire and hatred, O Bharatha.\n\nAll beings go into delusion at creation, O scorcher of enemies.",
 "The sins of those who have done pious deeds have passed away\n\nThey, freed from the delusion of duality, worship Me with firm vows.",
 "Those who take refuge in Me and strive for liberation from old age and death.\n\nThey know that whole Brahman, the whole inner Self and all action.",
 "Those who know Me as the Adhidaiva of the Sadhibhutas and the Sadhiyajna.\n\nAnd even at the time of departure they know Me with steady minds.",
 "Arjuna said\n\nWhat is that Brahman, what is the Adhyatma, and what is action, O Purushottama?\n\nAnd what is said of the Adhibhuta and what is called the Adhidaiva?",
 "How and who is the Adhiyajna here in this body, O Madhusoodana?\n\nAnd how should the self-controlled know Thee at the time of departure?",
 "Sri Bhagavan said\n\nThe imperishable Brahman, the Supreme Self, is called Adhyatma.\n\nThe excretion which gives rise to the beings and beings is called karma.",
 "The supernatural is the perishable being, and the Purusha is the superdivine.\n\nI alone am the Adhi-yajna here in this body, O best of embodied beings.",
 "And at the end of time, remembering Me alone, leaving the body.\n\nHe who goes forth goes forth to My Being, there is no doubt about it.",
 "Whichever or whichever being he remembers, he eventually leaves the body.\n\nHe attains to That That, O Arjuna, always meditating on That Being.",
 "Therefore remember me at all times and fight\n\nWith your mind and intellect devoted to Me, you will undoubtedly come to Me.",
 "By a mind equipped with the Yoga of practice and not going anywhere else.\n\nHe goes to the Supreme Person, the divine, thinking of Arjuna.",
 "The poet, the disciplinarian of the Puranas\n\nHe who remembers the gems.\n\nThe creator of all, the inconceivable form\n\nThe color of the sun is beyond the darkness.",
 "With the mind unmoved at the time of departure\n\nEndowed with devotion and the power of yoga.\n\nProperly inserting the breath between the eyebrows\n\nHe attains to that divine Supreme Person.",
 "which the Vedic scholars call the letter\n\nIf they enter, they are devoid of passion.\n\nWhatever they desire, they practice celibacy\n\nI shall declare that step to you in summary.",
 "Closing all the doors and shutting the mind in the heart.\n\nPlacing the life-breath on his head he engaged himself in the meditation of yoga.",
 "Reciting the one-syllable Brahman, Om, and remembering Me.\n\nHe who departs leaving the body attains the Supreme Goal.",
 "He who always remembers Me with an exclusive mind.\n\nI am easily accessible to that ever-steadfast Yogi, O Arjuna.",
 "Having attained Me, rebirth is an eternal abode of misery.\n\nThe great souls who have attained the Supreme Perfection do not attain it.",
 "The worlds are recurrent from the Brahma world, O Arjuna.\n\nBut having attained Me, O Arjuna, there is no rebirth.",
 "They know that the day of the Brahman is up to a thousand ages.\n\nThose men who know the day and night know the night for the end of a thousand ages.",
 "All persons arise from the unmanifest at the coming of the day.\n\nAt the coming of night they dissolve there into the unmanifest.",
 "That same group of beings becomes and dissolves.\n\nAt the coming of night, O Arjuna, it arises helplessly at the coming of day.",
 "But beyond that there is another being, the unmanifest, the eternal from the unmanifest.\n\nHe who is not destroyed by all beings who are destroyed.",
 "That which is called the unmanifest imperishable is called the Supreme Goal.\n\nThat is My supreme abode which they attain and never return to.",
 "That Supreme Person, O Arjuna, is attainable by devotion without exclusion.\n\nWithin Whom all beings dwell and by Whom all this is pervaded.",
 "Where in time, however, the Yogis do not return and return.\n\nI shall tell you, O best of the Bharatas, that time when those who have passed away pass away.",
 "Fire, light, day, white, six months, Uttarayana.\n\nHaving gone there, the knowers of Brahman go to Brahman.",
 "Smoke is the night and darkness is the six months of the southern moon\n\nThere, having attained the lunar light, the Yogi withdraws.",
 "These are the movements of the world in white and black, according to the eternal.\n\nBy one he goes to irreversibility and by another he returns again.",
 "Knowing these creations, O Arjuna, no Yogi is deluded.\n\nTherefore at all times be steadfast in Yoga, O Arjuna.",
 "in the Vedas, in sacrifices and in austerities\n\nThe meritorious fruits which are given in charity.\n\nIt goes beyond knowing all this\n\nThe yogi attains the supreme abode and the original.",
 "Sri Bhagavan said\n\nBut I will tell you this most secret thing, O non-envious one.\n\nKnowledge accompanied by realization, knowing which thou shalt be liberated from evil.",
 "This is the royal knowledge, the royal secret, the sacred and the best.\n\nTo do directly understandable, righteous, pleasant and inexhaustible.",
 "O scorcher of enemies men have no faith in this righteousness\n\nWithout attaining Me they return to the path of the world of death.",
 "I pervade this whole world in My unmanifest form.\n\nAll beings are in Me and I am not in them.",
 "Nor are beings in Me, behold My Yoga, the Lord.\n\nMy Self bears beings and does not abide in beings, but creates beings.",
 "Just as the great wind is always in the sky and moves everywhere\n\nThus understand that all beings are in Me.",
 "All beings, O Arjuna, attain to My Nature.\n\nAt the end of a Kalpa I again release them at the beginning of a Kalpa.",
 "I hold my nature and release it again and again.\n\nThis whole group of beings is under the control of nature.",
 "Nor do those actions bind Me, O Arjuna.\n\nindifferent as if indifferent, unattached to those actions.",
 "Under My presidency, nature gives birth to the moving and the unmoving.\n\nBy this cause, O Arjuna, the universe revolves.",
 "Fools despise Me, who have assumed a human body.\n\nNot knowing My Supreme Being, the great Lord of beings.",
 "They have vain hopes, vain actions, vain knowledge and are unconscious.\n\nThey have taken refuge in the deluding nature of the demons and the demons.",
 "But the great souls, O Arjuna, have taken refuge in Me, the divine Nature.\n\nThey worship with an exclusive mind, knowing the inexhaustible Being and the others.",
 "Constantly praising me and striving for firmness of vows\n\nAnd bowing down they worship Me with devotion ever steadfast.",
 "And others, sacrificing by the sacrifice of knowledge, worship Me.\n\nIt is omnipresent in many ways in oneness and separation.",
 "I am the sacrifice, I am the sacrifice, I am the offering, I am the medicine.\n\nI am the mantra, I am the oil, I am the fire, I am the oblation.",
 "I am the father of this world, the mother, the creator and the grandfather.\n\nThe Vedas, the sacred Omkara, the Rig Veda, the Sama Veda and the Yajur Veda.",
 "The refuge, the husband, the master, the witness, the abode, the refuge, the friend.\n\nOrigin, dissolution, place, treasure, seed and inexhaustible.",
 "I am heating up I am holding back and releasing the rain.\n\nI am immortality and death, the cause and the effect, O Arjuna.",
 "The three Vedas, the drinkers of the moon, have purified me of sins\n\nThey worship by sacrifices and pray for heavenly destination.\n\nThey attained the holy world of the gods\n\nThey enjoy the divine pleasures of the gods in heaven.",
 "They enjoyed that vast heavenly world\n\nWhen their merit is exhausted, they enter the world of mortals.\n\nShe has followed the Trinity Dharma\n\nThe desires of the flesh attain the past and the future.",
 "Those who worship Me thinking of no other.\n\nI bear the safety of Yoga for those who are ever engaged in it.",
 "Those who are devoted to other gods and worship with faith.\n\nThey too, O Arjuna, worship Me alone according to the prescribed rituals.",
 "For I am the enjoyer and also the Lord of all sacrifices.\n\nBut they do not know Me in truth and therefore they are lost.",
 "The devotees of the gods go to the gods and the devotees of the ancestors go to the ancestors.\n\nBeings go to the sacrifices of beings and even those who worship Me go to Me.",
 "He who offers me leaves, flowers, fruits and water with devotion.\n\nThat which is offered with devotion I eat by the self-controlled.",
 "Whatever you do, whatever you eat, whatever you sacrifice, whatever you give.\n\nWhatever austerities you perform, O Arjuna, offer them to Me.",
 "Thus thou shalt be liberated from the bonds of action by the fruits of good and evil.\n\nWith the mind steeped in the Yoga of renunciation, liberated, you will come to Me.",
 "I am equal to all beings; there is none to be hated or loved by Me.\n\nBut those who worship Me with devotion are in Me and I am in them.",
 "Even if the wicked worships Me exclusively.\n\nHe should be regarded as a saint for he has made a right decision.",
 "The righteous soon attains eternal peace.\n\nPromise Me, O Arjuna, that My devotee is not destroyed.",
 "For whoever, taking refuge in Me, O Arjuna, may be of sinful birth.\n\nWomen, Vaishyas and Sudras also attain the Supreme Goal.",
 "What to speak of the pious devoted brahmins and royal sages\n\nHaving attained this eternal and unhappy world, worship Me.",
 "Be mindful of Me, be devoted to Me, live in Me, and bow down to Me.\n\nThus fixing yourself on Me, you will come to Me.",
 "Sri Bhagavan said\n\nAgain, O mightyarmed one, hear my supreme words.\n\nWhat I shall tell you, dear one, for your welfare.",
 "Neither the hosts of gods nor the great sages know My origin.\n\nFor I am the origin of all the gods and the great sages.",
 "He who knows Me, the beginning of birth and death, the great Lord of the worlds.\n\nHe who is not deluded among mortals is freed from all sins.",
 "Intelligence, knowledge, non-delusion, forgiveness, truth, restraint, and peace.\n\nHappiness, pain, being, absence, fear and also fearlessness.",
 "Non-violence, equality, contentment, austerity, charity, fame and disgrace.\n\nThere are different kinds of beings from Me alone.",
 "The seven great sages in the east and the four Manus.\n\nThese creatures of this world are born of the minds of those whose beings are born of Me.",
 "He who truly knows this glory and Yoga of Mine.\n\nHe is engaged in unshakable Yoga, there is no doubt about it.",
 "I am the source of all things and all things proceed from Me.\n\nThinking this, the wise worship Me with meditation.",
 "My mind and life in Me, enlightening each other.\n\nAnd they are always satisfied and delighted in telling Me.",
 "Those who are constantly engaged worship Him with love.\n\nI give them the Yoga of intelligence by which they attain to Me.",
 "For their own sake I am the darkness born of ignorance.\n\nI destroy them by the shining lamp of knowledge in my Self-being.",
 "Arjuna said\n\nThou art the Supreme Brahman, the Supreme Abode, the Holy One, the Supreme.\n\nThe eternal Purusha, the divine, the original God, the unborn and the almighty.",
 "All the sages, including the divine sage Narada, have said this about you.\n\nAsita Devala Vyasa and you yourself are telling me.",
 "I think all this is true that you tell me, O Kesava.\n\nFor neither the gods nor the demons, O Lord, know Thy manifestation.",
 "You know yourself by yourself, O best of men.\n\nO creator of beings, lord of beings, god of gods, lord of the universe.",
 "You should tell me the rest, for the glories of the Self are divine.\n\nwith which glories Thou pervades these worlds.",
 "How can I know the Yogi, always thinking of Thee?\n\nIn what and in what states, O Lord, are You to be thought of by me?",
 "In detail, O Janardana, the Yoga and glory of the Self.\n\nTell me again for I am not satisfied to hear it.",
 "Sri Bhagavan said\n\nOh, I will tell you about the divine glories of the Self.\n\nIn priority, O best of the Kurus, there is no end to my details.",
 "I am the Self, Gudakesha, dwelling in the hearts of all beings.\n\nI am the beginning and the middle and the end of all beings.",
 "I am Vishnu among the suns, and the sun and the moon among the lights.\n\nAmong the Maruts I am Marichi; among the stars I am the moon.",
 "Among the Vedas I am the Sama Veda; among the gods I am Vasava.\n\nI am the mind of the senses and I am the consciousness of beings.",
 "Among the Rudras I am Shankara and among the Yakshas and Rakshasas I am the lord of wealth.\n\nAnd I am the fire among the Vasus, and I am Meru among the peaks.",
 "And know Me, O Arjuna, to be Brihaspati, the chief among the priests.\n\nI am Skanda among the armies and I am the ocean among the lakes.",
 "Among the great sages, Bhrigu, I speak the one syllable.\n\nAmong sacrifices I am the sacrifice of chanting and among immovable things I am the Himalayas.",
 "Ashvattha among all trees and Narada among the gods and sages.\n\nChitraratha among the gandharvas and sage Kapila among the siddhas.",
 "Know Me to be the source of nectar among horses of loud voices.\n\nAiravata among the lord of elephants and the king of men.",
 "I am the thunderbolt among weapons, and the milk of desire among cows.\n\nAnd I am the progenitor, Cupid, and Vasuki among the serpents.",
 "And I am Infinite among the serpents, and Varuna among the aquatics.\n\nI am Aryama among the ancestors and Yama among the self-controlled.",
 "And I am Prahlada among the demons, and I am Kala among the calculators.\n\nAnd I am the lion among beasts and Vainateya among birds.",
 "I am the wind among the winds and Rama among the wielders of weapons\n\nAmong the fish I am the shark and among the streams I am the Jahnavi.",
 "I am the beginning and the end and the middle of creation, O Arjuna.\n\nI am the knowledge of the spiritual and the debate of the knowledgeable.",
 "I am the Akara of the letters and the dual of the compound.\n\nI alone am the inexhaustible time, the creator, all-facing.",
 "I am death and destroyer of all and the origin of all things to come.\n\nFame, beauty, speech, memory, intelligence, patience and forgiveness of women.",
 "I am the Brihat Sama and the Gayatri of the Samas.\n\nI am Margashirsa among the months and Kusumakara among the dead.",
 "I am the gambler of the cheaters, and the splendor of the splendourful.\n\nI am victory, I am determination, I am Sattva among the Sattvas.",
 "I am Vasudeva among the Vrishnis and Arjuna among the Pandavas.\n\nAmong the sages I am Vyasa and among the poets I am Usanas the poet.",
 "I am the punishment of those who restrain, and I am the policy of those who seek to conquer.\n\nAnd I am silence among the secrets and knowledge among the knowers.",
 "And whatever is the seed of all beings, that is I, O Arjuna.\n\nThere is nothing that exists without Me, whether moving or unmoving.",
 "There is no end to My divine glories, O Parantapa.\n\nThis is the detail of the glory which I have described for the purpose.",
 "Whatever being is glorious, prosperous or powerful.\n\nThat very thing, know thou, to be a part of My splendour.",
 "Or what is your knowledge of this much, O Arjuna?\n\nI exist in this whole world in one part.",
 "Arjuna said\n\nFor My grace, the supreme secret is called the Adhyatma.\n\nBy the words which you have spoken this delusion is gone from me.",
 "I have heard in detail about the creation and destruction of beings\n\nFrom Thee, O lotus-eyed one, also comes the inexhaustible greatness.",
 "Thus it is as Thou hast said of Thyself, O God.\n\nI wish to see Thy divine form, O Supreme Person.",
 "If you think I can see that, sir.\n\nO Lord of Yoga then show me Thy inexhaustible Self.",
 "Sri Bhagavan said\n\nBehold, O Arjuna, My forms in hundreds and then in thousands.\n\nThey were of various kinds and divine colors and shapes.",
 "Behold the suns, the Vasus, the Rudras, the Shivas and the Maruts.\n\nBehold many wonders never seen before, O Arjuna.",
 "Look at the whole world, moving and unmoving, here alone.\n\nO Gudakesha whatever else you wish to see in my body.",
 "But you cannot see me with your own eyes\n\nI give thee divine eyes behold My divine Yoga.",
 "Sanjaya said\n\nO King having thus spoken the lord of great yoga Hari\n\nHe showed Arjuna His supreme divine form.",
 "Many faces and eyes and many wonderful sights.\n\nMany divine ornaments and many divine weapons raised.",
 "He was dressed in divine garlands and clothes and anointed with divine perfumes\n\nThe God of all wonders, the infinite, the omnipresent.",
 "A thousand suns will rise simultaneously in the sky\n\nIf the light is similar to that, it would be the light of that great soul.",
 "There is the whole world in one, divided into many parts.\n\nThen Pandavas saw the body of the gods.",
 "Then Arjuna, filled with wonder, his hair cheerful.\n\nHe bowed his head to the god and addressed him with folded hands.",
 "Arjuna said\n\nI see the gods in your body, O God\n\nand all the hosts of special beings.\n\nBrahman, Lord, seated on the lotus\n\nand all the divine sages and followers.",
 "Many arms, stomach, mouth and eyes\n\nI see you in infinite form everywhere.\n\nNo end, no middle, no repetition\n\nI see the Lord of the universe, the form of the universe.",
 "The crown, the scepter, and the wheel\n\nA mass of light shining everywhere.\n\nI see you hard to look at all around\n\nThe brightness of the blazing fire and the sun is immeasurable.",
 "You are to be known as the Supreme Absolute\n\nYou are the ultimate treasure of this universe.\n\nThou art the inexhaustible protector of eternal righteousness\n\nI consider You to be the eternal Purusha.",
 "Eternal, intermediate and infinitely powerful\n\nManantabahum moon and sun eyes.\n\nI see you with the face of a blazing fire\n\nHeating the universe with His own effulgence.",
 "For this is the difference between heaven and earth\n\nYou alone pervade all directions\n\nSeeing your wonderful and fierce appearance\n\nThe three worlds are disturbed, O great soul.",
 "For these are the hosts of the gods who enter you\n\nSome are frightened and sing with folded hands.\n\nThe hosts of great sages and Siddhas said, \"Good luck\n\nThey praise Thee with abundant praises.",
 "Rudra, Aditi, Vasu and all the Sadhyas\n\nIn the universe, the Aśvinī-kumāras, the Maruts and the Choṣmapas.\n\nGandharvas, Yakshas, ​​Demons and Siddhas\n\nThey all look at you in amazement.",
 "The form is great and you have many faces and eyes\n\nO mighty-armed one, with many arms and thighs.\n\nIt is terrible with many stomachs and many teeth\n\nSeeing this the worlds were disturbed and so was I.",
 "It touched the sky and glowed in many colours\n\nHis face was wide open and his eyes were bright and large.\n\nSeeing you my innermost being is distressed\n\nI find neither patience nor peace, O Vishnu.",
 "Their faces are terrible with fangs\n\nThey looked like the fire of time.\n\nI don't know the directions and I'm not ashamed\n\nHave mercy, O Lord of the gods, inhabitant of the universe.",
 "And these are you, the sons of Dhritarashtra\n\nAll together with the hosts of the guardians of the earth\n\nBhishma, Drona, and so on, the son of Suta\n\nwith our chief warriors.",
 "They enter the mouths in a hurry\n\nThe fangs are terrible and terrible.\n\nSome are separated between teeth\n\nThey are seen with their upper limbs crushed.",
 "Like many rivers with their currents\n\nThey run towards the sea.\n\nand Tavami, the hero of the world\n\nThey enter the mouths and burn.",
 "Like a burning flame moth\n\nRich speeds enter for destruction.\n\nSimilarly, the worlds enter into destruction\n\nYour mouths are also rich in speed.",
 "Lelihyase swallowing all around\n\nThe whole worlds with flaming faces.\n\nfilling the whole world with light\n\nYour fierce rays, O Vishnu, are burning.",
 "Tell me who you are, O fierce-looking one\n\nObeisance to you, O best of the gods, have mercy.\n\nI want to know you first\n\nI do not know your instincts.",
 "Sri Bhagavan said\n\nI am time, the destroyer of the worlds, grown up\n\nHe is here to gather the worlds.\n\nNot everyone will be except you\n\nThe warriors who are stationed in the opposing armies.",
 "Therefore rise up and gain fame\n\nConquer your enemies and enjoy a prosperous kingdom\n\nI have already killed them\n\nBe only an occasion, Savyasachin.",
 "Drona and Bhishma and Jayadratha\n\nKarna and other brave warriors.\n\nKill those I have killed and do not be distressed\n\nFight and you will conquer your enemies in battle.",
 "Sanjaya said\n\nHearing this, Keshav said\n\nThe crown trembled with folded hands.\n\nHe bowed down and again said to Krishna\n\nHe bowed down in terror, stunned.",
 "Arjuna said\n\nIn place, Hrishikesh, by your fame\n\nThe world rejoices and is pleased.\n\nThe demons are scared and run in all directions\n\nAll the hosts of Siddhas will bow down.",
 "And why do they not bow down, O great soul?\n\nYou are the greatest, even the originator of the Brahman.\n\nInfinite Lord of the universe\n\nThou art the imperishable, the cause and the effect, the Supreme Being.",
 "You are the original God, the Purusha, the Purana\n\nYou are the ultimate treasure of this universe.\n\nThou art the knower of the knowable and the supreme abode\n\nBy Thee is the universe pervaded, O infinite form.",
 "Vayu, Yama, Agni, Varuna and the Moon\n\nYou are the Creator and the Great-Grandfather.\n\nObeisance to you, Obeisance to you, a thousand times\n\nAgain and again, I offer my obeisances to Thee.",
 "Obeisance to you from the front and from the rear\n\nObeisance to you everywhere and all.\n\nYou are infinitely powerful and immeasurably mighty\n\nYou attain everything and then you are everything.",
 "What he said forcefully, considering him a friend\n\nO Krishna, O Yadava, O Sakheti.\n\nNot knowing your glory\n\nWhether by negligence or by my love.",
 "And that you are disrespected for the sake of ridicule\n\nIn recreation, bed, seat and meals.\n\nAlone or even infallible in front of it\n\nThat I forgive you, immeasurable.",
 "You are the father of the world and of all beings\n\nYou are his revered and greatest teacher.\n\nThere is none equal to you, and no one greater than you\n\nHe has unparalleled power even in the three worlds.",
 "Therefore, bowing down, meditate on the body\n\nI beg you, I worship the Lord.\n\nLike a father to a son, a friend to a friend\n\nDear to your beloved, O Lord, you deserve to bear it.",
 "I am delighted to see something I have never seen before\n\nAnd my mind is troubled with fear.\n\nShow me that very form, O God\n\nHave mercy, O Lord of the gods, inhabitant of the universe.",
 "The crown, the scepter, the wheel-hand\n\nI wish to see you in the same way\n\nIn the same form as the quadrilateral\n\nO thousand-armed one, O form of the universe.",
 "Sri Bhagavan said\n\nI am pleased to say this to you, Arjuna\n\nThe form is shown beyond self-combination.\n\nThe luminous universe is infinite and original\n\nwhich I have never seen before except you.",
 "not by the study of the Vedas and sacrifices, nor by charity\n\nnor by rituals nor by severe austerities.\n\nSuch a form can I be in the world of men\n\nTo be seen by anyone other than you, O hero of the Kurus.",
 "Don't be in pain and don't be confused\n\nSeeing this terrible form of mine\n\nYou are again happy with your fears dispelled\n\nThat is what this form of Mine is, look at it.",
 "Sanjaya said\n\nThus Vasudeva said to Arjuna\n\nHe showed his form again.\n\nHe reassured him who was frightened\n\nBecoming again a gentle-faced great soul.",
 "Arjuna said\n\nSeeing this gentle human form of Thyself, O Janardana.\n\nNow I am restored to consciousness and have returned to nature.",
 "Sri Bhagavan said\n\nYou have seen this form of mine which is very difficult to see\n\nEven the gods are ever longing to see this form.",
 "I am not by the Vedas, nor by austerities, nor by charity, nor by sacrifice.\n\nIt is possible to see such a thing as you have seen Me.",
 "But by devotion without exclusion I am thus possible, O Arjuna.\n\nto know and to see and to enter into the truth, O scorcher of enemies.",
 "He who does My works, who is supreme in Me, who is devoted to Me, and who is devoid of attachment.\n\nHe who is free from enmity towards all beings attains Me, O Arjuna.",
 "Arjuna said Those devotees who thus worship Thee, ever steadfast, and who among them are the imperishable and the unmanifest, who are the best in Yoga?",
 "The Supreme Personality of Godhead said: Those who worship Me, ever steadfast, fixing their minds on Me, endowed with supreme faith, are considered by Me to be the most steadfast.",
 "But those who worship the imperishable, the indescribable, the unmanifest, the omnipresent, the unthinkable, the unchanging, the eternal.",
 "Having controlled the sense-groups and being of equal mind everywhere, they attain Me alone, devoted to the welfare of all beings.",
 "The suffering is greater for those whose minds are attached to the unmanifest.\n\nFor the unmanifest path is attained by the embodied through suffering.",
 "But those who, having renounced all actions in Me and are devoted to Me, worship Me, meditating on Me by the infinite Yoga.",
 "I shall soon become their deliverer from the ocean of the world of death, O Arjuna, whose minds are fixed in Me.",
 "Fix your mind on Me alone and concentrate your intellect on Me. You will no doubt abide in Me alone from this time forward.",
 "But if thou canst not fix thy mind steadily on Me, then by the Yoga of practice desire to attain Me, O Arjuna.",
 "Even if you are unable to practice, become devoted to My actions. Doing actions even for My sake, you will attain perfection.",
 "But if thou be unable to do even this, having taken refuge in My Yoga, then renounce the fruits of all actions and act with self-control.",
 "For knowledge is better than practice, and knowledge is better than meditation. From meditation is renunciation of the fruits of action, and from renunciation is peace.",
 "He is unhateful, friendly and compassionate to all beings, free from attachment and egoism, equal in pain and pleasure, and forgiving.",
 "He who is ever satisfied, the Yogi, self-controlled, firm in determination, whose mind and intellect are offered to Me, who is My devotee, he is dear to Me.",
 "He from whom the world is not afraid and who is not afraid of the worlds, and who is freed from joy, anger, fear and anxiety, he is dear to Me.",
 "He who is unselfish, pure, competent, indifferent, free from pain, and who renounces all beginnings and is My devotee, he is dear to Me.",
 "He who neither rejoices nor hates nor grieves nor desires, renounces good and evil and is devoted to Me, he is dear to Me.",
 "He is equal to the enemy and to the friend, and to honor and dishonour. He is equal in cold and heat, in pleasure and pain, and devoid of attachment.",
 "He who is equal to condemnation and praise, silent and satisfied with whatever he has, who is homeless, steady in mind and devoted, is dear to Me.",
 "But those who worship this righteous nectar as stated, having faith and being supremely devoted to Me, they are very dear to Me.",
 "Arjuna said\n\nNature and the Purusha, the field and the knower of the field.\n\nI wish to know this knowledge and the knowable, O Kesava.",
 "The Supreme Personality of Godhead said: This body, O Arjuna, is called the field.",
 "And know Me as the knower of the field in all fields, O Bharatha.\n\nThat knowledge of the field and the knower of the field is considered by Me to be knowledge.",
 "Hear from me in brief what that field is and what its transformation is and whence it comes and what it is and what its power is.",
 "It has been sung in many ways by the sages in various verses separately and in the words of the Brahma Sutras with reasonable and certain verses.",
 "The great beings are ego, intellect and the unmanifest. The senses are ten and one and the five perceivable by the senses.",
 "Desire, hatred, pleasure, pain, aggregation, consciousness and endurance. This field has been briefly described with its transformations.",
 "Humility, arrogance, non-violence, forbearance, simplicity, worship of the teacher, purity, steadfastness, self-control.",
 "Renunciation of sense objects and lack of egoism. Perception of birth, death, old age, disease, pain and evil.",
 "Unattachment, non-attachment to sons, wives, houses and so on.",
 "And in Me, by exclusive yoga, devotion is unwavering.",
 "The eternity of spiritual knowledge is the vision of the meaning of knowledge of the truth.",
 "I shall declare that which is to be known, knowing which one attains to immortality.",
 "That which has hands and feet everywhere, eyes, head and mouth everywhere, envelops everything in the world.",
 "Reflecting the modes of all the senses, devoid of all senses, unattached, bearer of all, devoid of modes and enjoyer of the modes.",
 "Without and within beings, the immovable and the ultimate, that which is unknowable because of its subtlety, that which is far away and that which is near.",
 "And undivided and existing as if divided among beings, it is to be known as the supporter of beings, the devourer and the originator.",
 "That light of the lights is called beyond darkness. Knowledge, the knowable, the accessible to knowledge, dwells in the heart of everyone.",
 "Thus the field and the knowledge and the knowable have been stated in brief. My devotee, knowing this, attains to My being.",
 "Know Nature and the Purusha, both without beginning. Know also the transformations and the modes born of Nature.",
 "The cause in being the doer of cause and effect is called nature. The cause in being the enjoyer of pleasures and pains is called nature.",
 "For man, abiding in Nature, enjoys the alities born of Nature.",
 "The seer, the permitter, the husband, the enjoyer, the great Lord, is also called the Supreme Self, the Supreme Person in this body.",
 "He who thus knows the Purusha and Nature along with the alities, though existing in all respects, is not born again.",
 "Some see the Self in the Self by meditation, others by the Yoga of Sankhya and still others by the Yoga of action.",
 "Others, not knowing this, hear and worship from others. They too, devoted to the hearing, cross over death.",
 "As long as any being, movable or immovable, is born from the union of the field with the knower of the field, know that, O best of the Bharatas.",
 "He who sees the Supreme Lord, dwelling equally in all beings, perishes and perishes Himself.",
 "For seeing the Lord equally present everywhere, he does not kill himself by himself; thereafter he attains to the Supreme Goal.",
 "And by nature alone actions are performed in all respects. He who sees thus sees the Self as the doer.",
 "When he sees the separateness of beings in one, then he attains to the expansion of the Brahman.",
 "Being eternal and devoid of the modes, this Supreme Self is inexhaustible. Even though in the body, O Arjuna, He neither acts nor is tainted.",
 "Just as the omnipresent sky is not tainted by its subtlety, so the Self, dwelling everywhere in the body, is not tainted.",
 "As the sun alone illuminates this whole world, so the fielder illuminates the whole, O Bharatha.",
 "Those who know thus the difference between the field and the knower of the field with the eye of knowledge and the liberation of beings and nature attain to the Supreme.",
 "The Supreme Personality of Godhead said: I shall again declare to you the supreme knowledge, the best of all knowledges, knowing which all the sages have attained supreme perfection.",
 "Having taken refuge in this knowledge they have attained to equality with Me. They are not born even in creation nor are they disturbed in annihilation.",
 "My womb is the great Brahman in whom I place the womb. Then all beings are born, O Arjuna.",
 "In all wombs, O Arjuna, idols are born; of those Brahman, the great womb, I am the seed-giving father.",
 "The modes of nature, namely Sattva, Rajas and Tamas, bind, O mighty-armed one, the imperishable embodied in the body.",
 "There Sattva, being pure, illuminating and healthy, is bound by attachment to happiness and by attachment to knowledge, O sinless one.",
 "Know that Rajas, which is the source of passion, arises from attachment to craving. That, O Arjuna, binds the embodied by attachment to action.",
 "But know thou that darkness, born of ignorance, is the delusion of all embodied beings; it is bound by heedlessness, laziness and sleep, O Arjuna.",
 "Sattva accumulates in happiness, Rajas in action, O Arjuna; but darkness, covering knowledge, accumulates in heedlessness.",
 "Rajas and Tamas are overcome by Sattva, O Arjuna. Rajas is Sattva and Tamas is Tamas, and Sattva is Rajas.",
 "Light is produced in this body through all the gates.",
 "Greed, instinct, the beginning of actions, uncontrolled desire, these are born of Rajas when it is developed, O best of the Bharatas.",
 "Lack of light, lack of instinct, heedlessness and delusion, these are born of increased darkness, O son of the Kurus.",
 "But when the embodied being, having developed in Sattva, goes to annihilation, then he attains to the spotless worlds of the knowers of the best.",
 "He goes to annihilation in Rajas and is born in the associates of action.",
 "They say that the pure fruit of good action is Sattvic; the fruit of Rajas is pain and ignorance is the fruit of Tamas.",
 "From Sattva arises knowledge and from Rajas greed; from heedlessness and delusion arises ignorance from Tamas.",
 "The Rajasic go upwards in the state of Sattva and remain in the middle; the Tamasic go downwards in the mode of inferiority.",
 "When the seer sees no agent other than the modes, and knows Me to be beyond the modes, he attains to My Being.",
 "Having transcended these modes, the three-embodied being born of the body, freed from birth, death, old age and pain, attains to immortality.",
 "Arjuna said: One who speaks these three modes of nature, O Lord, is transcended. What is conduct and how does one transcend these three modes of nature?",
 "The Supreme Personality of Godhead said: Light and instinct and delusion, O Arjuna, he neither hates what is initiated nor desires what is withdrawn.",
 "He who sits like an indifferent person and is not moved by the modes of nature.",
 "He is equal in pain and pleasure, healthy, equal in clay, stone and gold.",
 "He is equal in honor and dishonour, equal in friends and enemies. He who renounces all beginnings is said to be transcendental to the modes.",
 "And he who serves Me without distraction by the Yoga of devotion, transcending these modes, is fit to become Brahman.",
 "For I am the abode of Brahman, the immortal, the inexhaustible, the eternal, the righteous, the happy and the solitary.",
 "The Supreme Personality of Godhead said: They say that the peach tree with its upper root and lower branch is inexhaustible.",
 "The branches of it extend from below and upwards, the buds of the senses enlarged by virtue, and the roots of it continue below, connected with action in the world of men.",
 "My form is not so perceived in this world, nor is there any end, nor any beginning, nor any establishment.",
 "Then one should seek that step to which they have gone and never return again.",
 "They are devoid of pride and delusion, having conquered the evils of attachment, and are constantly devoid of desires for the Self.",
 "Neither the sun nor the moon nor the fire illuminates that; to which they go and never return, that is My supreme abode.",
 "This very part of Me, becoming a living being in the world of living beings, is eternal. The mind attracts the sixth senses situated in nature.",
 "Whatever body the Lord attains and whatever He leaves, the wind takes these and goes away from the dwelling of the smells.",
 "Having possessed the ear, the eye, the touch, the taste and the smell, the mind also enjoys the sense objects.",
 "The deluded do not perceive, whether they are moving or standing or eating, endowed with virtues; they see with the eyes of knowledge.",
 "And the Yogis who strive see Him dwelling in the Self; though they strive, the unconscious do not see Him.",
 "That effulgence which is in the sun illuminates the whole world; that effulgence which is in the moon and that which is in the fire know thou to be Mine.",
 "I enter the earth and sustain all beings by My energy; I nourish all herbs and being the moon in the form of taste.",
 "Being Vaisvanara, I take refuge in the body of living beings, and, composed of breathing and inhaling, I digest the four kinds of food.",
 "I am dwelling in the heart of everyone; from Me comes remembrance, knowledge and destruction. And by all the Vedas I alone am to be known; I am the author of Vedanta and the knower of the Vedas.",
 "These two Persons in this world are the imperishable and the imperishable. The imperishable is all beings and the unchanging is called the imperishable.",
 "The Supreme Person is another, declared to be the Supreme Self, the inexhaustible Lord who pervades and sustains the three worlds.",
 "Because I am transcendental to the imperishable and superior to the imperishable, therefore I am renowned in the world and in the Vedas as the Supreme Person.",
 "He who thus, undeluded, knows Me as the Supreme Person, he who knows everything worships Me with all his being, O Arjuna.",
 "Thus, O sinless one, have I declared this most secret scripture;",
 "Sri Bhagavan said\n\nFearlessness, purification of the Sattva, and the establishment of knowledge and yoga.\n\nCharity, restraint, sacrifice, study of the Vedas, austerity and uprightness.",
 "Non-violence, truth, anger, renunciation, peace, non-violence, compassion for beings, non-covetousness, gentleness, modesty, and fickleness.",
 "Brilliance, forgiveness, patience, purity, betrayal, and not arrogance.\n\nThey become the divine wealth of the born, O Arjuna.",
 "Pride, arrogance, conceit, anger and harshness, and ignorance, O Arjuna, are the demoniac wealth of the inborn.",
 "The divine wealth is considered to be the demoniac for the liberation of the essay. Do not grieve, O Arjuna, for thou art born with divine wealth.",
 "There are two creations of beings in this world, destiny and the demon. Destiny has been declared in detail; hear from Me, O Arjuna, the demoniac.",
 "The demons do not know instinct and renunciation; neither purity nor conduct nor truth is found in them.",
 "They say that the world is untrue, unestablished, and divine.",
 "Holding this sight, the lost souls of little intelligence arise, the perpetrators of terrible deeds, the enemies of the world for the destruction.",
 "Relying on lust which is difficult to fulfill, they are filled with pride and intoxication;",
 "They resorted to immeasurable anxiety and the end of annihilation.",
 "Bound by hundreds of ropes of hope, devoted to lust and anger, they strive unjustly to accumulate wealth for the enjoyment of lust.",
 "This I have obtained today I shall attain this desire. This is mine and this will be my wealth again.",
 "That enemy I have slain I shall slay others also. I am the Lord; I am the enjoyer; I am perfect; I am strong; I am happy.",
 "I am rich and well-off, and who else is like me? I will sacrifice, I will give, I will rejoice, deluded by ignorance.",
 "Bewildered by many minds and enveloped in the web of delusion, attached to the pleasures of lust, they fall into an unclean hell.",
 "Self-conceived, stupefied, filled with wealth, honor and pride, they sacrifice name sacrifices out of pride and according to the ordinances.",
 "Relying on egoism, strength, pride, lust and anger, they are envious of Me, hating Me in the bodies of themselves and others.",
 "I cast those whom I hate, the cruel and the lowest of men, into the wombs of demons for ever and ever.",
 "Fools who have attained the demoniac womb from birth to birth, having attained Me, O Arjuna, then attain the lowest state.",
 "This is the threefold gate of hell, the destruction of the self; lust, anger and greed; therefore one should abandon these three.",
 "A man, liberated from these three gates of darkness, O Arjuna, performs the welfare of the self; thereafter he attains to the Supreme Goal.",
 "He who, leaving the precepts of the scriptures, acts according to desire, attains neither perfection nor happiness nor the Supreme Goal.",
 "Therefore the scriptures are your authority in the arrangement of action and inaction.",
 "Arjuna said: Those who sacrifice with faith, abandoning the ordinances of the scriptures, what is their fixation, O Krishna, is Sattva or Rajas or Tamas?",
 "The Supreme Personality of Godhead said: There are three kinds of faith in the embodied; that is inherent in nature; the Sattvic, the Rajasic and the Tamasic. Hear of that.",
 "The faith of everyone is in accordance with Sattva, O Arjuna.",
 "The Sattvic worship the gods, the Rajasic worship the yakshas and rakshasas; the Tamasic men worship the dead and hosts of ghosts.",
 "Those men who practice terrible austerities prescribed by the unscriptural are endowed with pride and egoism and are endowed with the strength of lust and passion.",
 "Drawing away the unconscious host of beings in the body and Me in the inner body, know them to be of demoniac determination.",
 "Food also is dear to all in three ways: sacrifice, austerity and charity. Hear now the distinction between them.",
 "They increase life, strength, health, happiness and pleasure.",
 "Katvamallavnatyushnatikshanarukshavidahinah.",
 "That which is gone, tasteless, pus, and parched, and even leftover food, which is unclean, is dear to the Tamasic.",
 "That sacrifice which is offered according to the prescribed rituals by those who desire no reward, having fixed the mind that it is to be sacrificed, is Sattvic.",
 "But that sacrifice which is offered with the intention of obtaining the fruit and also for the sake of pride, O best of the Bharatas, know thou to be that sacrifice which is Rajasic.",
 "Without rituals, without food created, without mantras, without alms, without faith, they declare sacrifice to be Tamasic.",
 "Worship of gods, brahmins, teachers and sages, purity, simplicity, celibacy and non-violence are called bodily austerities.",
 "That speech which is free from anxiety, truthful and pleasant and beneficial, and the practice of study and speech, is called austerity.",
 "The gratification of the mind, gentleness, silence, self-control, and the purification of the mind are called austerities of the mind.",
 "Those three kinds of austerities performed with supreme faith by men endowed with the desire for nothing are regarded as Sattvic.",
 "That which is done by austerity and pride for the sake of honour, honor and worship is here declared to be Rajasic, movable and immovable.",
 "That austerity which is performed by foolish grasping for the torment of the self or for the destruction of another is declared to be Tamasic.",
 "That charity which is given to the unhelpful in a place and time and to a person who thinks it should be given is regarded as Sattvic.",
 "But that which is given with difficulty for the sake of reward or for the sake of reward is regarded as Rajasic.",
 "That which is given at an untimely place and to the unworthy, disrespected and despised, is declared to be Tamasic.",
 "The instruction of the Brahman that it is true is said to be of three kinds. The Brahmans were prescribed by him in the past the Vedas and the sacrifices.",
 "Therefore the acts of sacrifice, charity and austerities, called 'Domi', are always performed by the Brahma-vadis as prescribed by the prescribed rituals.",
 "Without seeking that, the acts of sacrifice, austerities and various acts of charity are performed, seeking liberation.",
 "This is used in the sense of goodness and in the sense of goodness. Thus, O Arjuna, the word sattva is applied to praiseworthy action.",
 "The state in sacrifice, austerity and charity is also called Sad. And the action for that purpose is called Sad.",
 "Whatever is sacrificed, given, austerities performed and performed without faith is called false, O Arjuna, and it is not here for us after death.",
 "Arjuna said\n\nI wish to know, O mighty-armed one, the truth of renunciation.\n\nAnd of renunciation, O Hrishikesha, separately, O destroyer of Keshi.",
 "Sri Bhagavan said\n\nThe sages know the renunciation of desirable actions as Sannyasa.\n\nThe wise say that renunciation is the renunciation of the fruits of all actions.",
 "Some sages say that action should be abandoned as a fault.\n\nOthers say that sacrifice, charity and austerities should not be abandoned.",
 "Hear from me with certainty there, O best of the Bharatas, in renunciation. For renunciation, O tiger among men, has been declared to be of three kinds.",
 "Sacrifice, charity and austerity are not to be abandoned; they are to be done. Sacrifice, charity and austerity are the holy things of the wise.",
 "But these also actions and their fruits should be performed, O Arjuna, is My certain and best opinion.",
 "But renunciation of action is not attained by the determined.",
 "He who abandons action which is called suffering for fear of bodily suffering does not attain the fruits of renunciation by performing Rajasic renunciation.",
 "That renunciation, O Arjuna, which is destined to be done as action, abandoning attachment and its fruits, is regarded as Sattvic.",
 "He does not hate evil action nor does he attach himself to evil.",
 "For it is not possible for the embodied to abandon actions completely. But he who renounces the fruits of actions is called a renunciant.",
 "There are three kinds of fruits of action, desirable, undesirable and mixed.",
 "Hear from Me, O mighty-armed one, these five causes, as stated in the Sāṅkhya-kṛtanta for the perfection of all actions.",
 "The abode and the doer and the doing are of different kinds, and the various actions are different, and destiny is the fifth here.",
 "These five are the causes of whatever action a man undertakes with his body, speech and mind, whether it be right or wrong.",
 "There, in this case, he who sees the doer as the Self alone, because of his immature understanding, does not see, he of evil mind.",
 "He whose feeling is not egotistical and whose intellect is not tainted.",
 "Knowledge, the knowable and the perceived are the threefold inducement to action.",
 "Knowledge, action and agent are threefold according to the distinction of the modes.",
 "Know that knowledge by which one sees the one inexhaustible Being in all beings, undivided among the divided, as Sattvic.",
 "But that knowledge which by separateness knows the various beings of different kinds in all beings, know that knowledge to be Rajasic.",
 "But that which is attached to one action as a whole without cause and as little as without real meaning is declared to be Tamasic.",
 "That action which is determined, free from attachment, done without attachment or hatred, by one who desires no reward, is called Sattvic.",
 "But that which is done with great effort by the desirous of desire or again by egoism is declared to be Rajasic.",
 "Attachment, decay, violence and manliness, regardless of the action, which is undertaken out of delusion, is called Tamasic.",
 "The doer who is free from attachment, who is not egoistic, who is endowed with patience and enthusiasm, who is free from change in success or failure, is called Sattvic.",
 "The passionate, seeking the fruits of action, greedy, violent, impure, full of joy and sorrow, the doer is declared to be Rajasic.",
 "The unjust, the ordinary, the stupefied, the deceitful, the unnatural, the lazy, the depressed and the long-suffering, the doer is called Tamasic.",
 "Hear thou, O Arjuna, the difference between intellect and patience in three ways according to their qualities, which I shall declare in detail and separately.",
 "That intellect which knows involvement and renunciation in action and in action, in fear and in fearlessness, in bondage and liberation, O Arjuna, is Sattvic (pure).",
 "That intellect which improperly perceives righteousness and irreligion, duty and inaction, O Arjuna, is Rajasic.",
 "That intellect which, enveloped by darkness, thinks iniquity to be righteousness and all objects of the opposite, O Arjuna, is Tamasic.",
 "That patience, by which the actions of the mind, life-force and senses are restrained, which is unwavering by Yoga, O Arjuna, is Sattvic (pure).",
 "But that patience which, O Arjuna, holds with patience Dharma, Kama and Artha, seeking the fruits by occasion, that patience, O Arjuna, is Rajasic.",
 "That patience of the foolish, O Arjuna, by which dream, fear, sorrow, depression and also intoxication does not give up, is Tamasic.",
 "But now hear from me, O best of the Bharatas, the threefold happiness; by practice one attains to the end of pain.",
 "That which is at first like poison and at the end like nectar is declared to be Sattvic happiness born of the grace of the Self-intelligence.",
 "That happiness which is at first like nectar from the union of the senses of objects and like poison in the end is regarded as Rajasic.",
 "That happiness which deludes the self before and after, arising from sleep, laziness and heedlessness, is declared to be Tamasic.",
 "There is no such thing on earth or in heaven or among the gods again.",
 "The actions of Brahmins, Kshatriyas, Vishas and Sudras, O scorcher of enemies, are divided by the virtues arising from their own nature.",
 "Serenity, restraint, austerity, purity, forbearance, and also simplicity, knowledge, realization, faith, Brahman-karma, born of the nature.",
 "Valour, splendour, fortitude, dexterity and even flight in battle, charity and godliness are the duties of a Kshatriya born of his own nature.",
 "Agriculture, cattle-keeping and trade are the duties of the Vaishyas.",
 "A man engaged in his own actions attains perfection. Hear how he who is engaged in his own actions attains perfection.",
 "By worshiping Him from whom all beings originate and by whom all this is pervaded, man attains perfection by his own actions.",
 "His own duty, devoid of virtue, is better than the duty of others performed by himself.",
 "One should not abandon instinctive action, O Arjuna, even with faults. For all undertakings are covered with faults, as fire is covered with smoke.",
 "The unattached intellect, having conquered the self everywhere and devoid of desire, attains by renunciation the supreme perfection of inaction.",
 "He who has attained perfection attains to Brahman as well as he attains to it. In summary, O Arjuna, that is the supreme fidelity of knowledge.",
 "Endowed with pure intellect and controlling himself with patience, abandoning sound and other objects and abandoning passion and hatred.",
 "He serves in solitude, eats little, controls his speech, body and mind, is devoted to meditation and yoga, and always takes refuge in detachment.",
 "The peaceful, free from egoism, strength, pride, lust, anger and attachment, is fit for becoming Brahman.",
 "He who has become Brahman and is happy in mind neither grieves nor desires. He who is equal to all beings attains supreme devotion to Me.",
 "By devotion he knows Me and whatever else I am in reality. Then, knowing Me in reality, he enters into the next.",
 "Always performing all actions, taking refuge in Me, he attains by My grace the eternal and inexhaustible abode.",
 "Renouncing all actions in Me with the mind and being devoted to Me, take refuge in the Yoga of intellect and be constantly mindful of Me.",
 "Mind Me, by My grace thou shalt escape all difficulties; but if thou wilt not hear Me, thou shalt perish.",
 "That which thou thinkest, relying upon egoism, thou shalt not fight; this is false thy occupation; nature will employ thee.",
 "O Arjuna, bound by your own action born of your own nature, that which you do not wish to do out of delusion you will do even under your control.",
 "The Lord resides in the hearts of all beings, O Arjuna, revolving all beings mounted on machines by His illusory energy.",
 "Take refuge in Him alone with all your heart, O Arjuna. By His grace you shall attain to the eternal abode of supreme peace.",
 "Thus have I declared unto thee the knowledge which is more secret than the secret. Consider this in its entirety and do as thou wilt.",
 "Hear again My supreme words, the most secret of all; thou art firmly desired by Me; then I shall tell thee what is good for thee.",
 "Be mindful of Me, devoted to Me, live in Me, bow down to Me. Thou shalt come to Me alone; truly I promise thee, thou art dear to Me.",
 "Abandon all dharmas and take refuge in Me alone; I will liberate thee from all sins; grieve not.",
 "This is never to be said to thee, nor to the ascetic, nor to the devotee, nor to the disobedient, nor to him who despiseth Me.",
 "He who will reveal this supreme secret to My devotees, having perfected his devotion to Me, will undoubtedly come to Me.",
 "And there is none among men more dear to Me than he; there shall be none on earth dearer to Me than he.",
 "And he who will study this righteous conversation between us by the sacrifice of knowledge, I think I shall be pleased with him.",
 "He who hears this with faith and without envy, he too is liberated and attains the auspicious worlds of the pious.",
 "Have you heard this, O Arjuna, with a single-minded mind? Have you lost your delusion of ignorance, O Arjuna?",
 "Arjuna said: By Thy grace I have lost my delusion and regained my memory, O infallible one.",
 "Sanjaya said Thus I have heard this wonderful and thrilling conversation between Vasudeva and the great soul Arjuna.",
 "By the grace of Vyasa I have heard this supreme secret of Yoga directly from Krishna, the Lord of Yoga, Himself describing it.",
 "O King remembering this wonderful conversation between Kesava and Arjuna I rejoice again and again.",
 "Remembering that very wonderful form of Hari\n\nI am greatly astonished, O king, and rejoice again and again.",
 "Where is Krishna, the Lord of Yoga, where is Partha, the bow-bearer?\n\nThere is prosperity, victory, happiness, firm morality and my consciousness."
]