[
 "You are strong, blessed, healthy, redeemed. You are God's masterpiece.",
 "But God didn't create you to be average. He created you to stand out, to go beyond the norm, to leave your mark on this generation.",
 "The older I get, the better I understand that every day is a gift.",
 "But I've learned that God's ways are better than our ways.",
 "Our mind is like a computer. How we program it is the way it's going to function.",
 "In difficult times, we're not supposed to quit believing; we're not supposed to quit growing.",
 "You control the doorway to what you allow in. You can dwell on every negative thought and every derogatory comment, or you can choose to delete it and dwell on what God says about you.",
 "The best decision of your life was to live your life with God at the center. That was the essential first step to living at your full potential.",
 "No matter what's happening, choose to be happy.",
 "Here is the key; you've got to send your words out in the direction you want your life to go. You cannot talk defeat and expect to have victory.",
 "Dreams and goals and are not just fleeting moments of inspiration. If acted upon, these moments can help us create a life that is exciting and fulfilling.",
 "Encouragement to others is something everyone can give.",
 "You weren't created to be average. You were created to excel. You have a destiny to fulfil, an assignment to accomplish.",
 "Words have creative power. They can be very helpful, like electricity. Used the right way, electricity powers lights, air-conditioning, and all kinds of good things.But electricity used the wrong way can be very dangerous. It can harm you, even kill you.",
 "Confidence is silent. Insecurities are loud.",
 "It takes determination to see a dream come to pass. The question is not will you start, but will you finish.",
 "The question is not, 'Do you have a problem?' The question is, 'Does the problem have you?'",
 "Most people can't recognize the good life when they have it... I believe, the good life, is simply when you are able to recognize all the good in your life - where ever and whenever that is.",
 "Don't make excuses, don't blame the past. The rest of your life can be the best of your life!",
 "You can choose to not let little things upset you.",
 "If one dream dies, dream another dream. If you get knocked down, get back up and go again.",
 "You're going to go through tough times -  that's life. But I say, 'Nothing happens to you, it happens for you.' See the positive in negative events.",
 "You can change your world by changing your words. Remember, death and life are in the power of the tongue.",
 "You cannot soar with the eagles as long as you hang out with the turkeys.",
 "We will never be able to recognize opportunities if we first don't recognize all that we have and all that we've been given.",
 "Your destiny is too important to spend it with people that are not making you better. Who are you allowing to influence you?",
 "Don't worry about your future or how you're going to accomplish a dream. God has already lined up what you need.",
 "Time is more valuable than money. We can make more money but we can't make more time. Use your time wisely.",
 "I believe if you keep your faith, you keep your trust, you keep the right attitude, if you're grateful, you'll see God open up new doors.",
 "Don't spend another minute down on yourself, living in regrets. God has forgiven you; forgive yourself. He's not condemning you. He's not pushing you down. Don't push yourself down.",
 "No matter who does you wrong, you don't have to stay defeated. Disappointments are inevitable, but misery is optional.",
 "Don't go into the new year holding a grudge from last year. Leave the hurts and disappointments behind.",
 "All of us can look back and see things that should have defeated us. You're still standing. That's the goodness of God.",
 "Get your mind going in the right direction and you'll get your life going in the right direction.",
 "Be a people builder. Look for opportunities to encourage others to bring out the best in them.",
 "Pass the test of being grateful for the small things and big things will be released in your life.",
 "Too often we get frustrated by difficulties. But you have to realize, you can't have a harvest without a few weeds.",
 "Nothing in life has happened to you. It's happened for you. Every disappointment. Every wrong. Even every closed door has helped make you into who you are.",
 "You're not really free until you're free from trying to please everybody.",
 "Choosing to be positive and having a grateful attitude is going to determine how you're going to live your life.",
 "A good thing to remember is somebody's got it a lot worse than we do.",
 "No one can offend you without your permission. They can say whatever they want, but you have the right to ignore it.",
 "God wants to bless you in such a way that people notice. He wants to show out in your life.",
 "Quit worrying about how everything is going to turn out. Live one day at a time.",
 "You have greatness in you. The key is to get it out.",
 "Love overlooks a person's faults... Anybody can return evil for evil, but God wants His people to help heal wounded hearts.",
 "Keep in mind, hurting people often hurt other people as a result of their own pain... The last thing they need is for you to make matters worse by responding angrily.",
 "To live your best life now, you must learn to trust God's timing ... God is arranging all the pieces to come together to work out His plan for your life.",
 "I'm not going to get upset. I'm not going to let people steal my joy.",
 "The more you talk about negative things in your life, the more you call them in. Speak victory not defeat.",
 "Start calling yourself healed, happy, whole, blessed, and prosperous. Stop talking to God about how big your mountains are, and start talking to your mountains about how big your God is!",
 "Don't waste your energy trying to convince people to understand you. Your time is too valuable to try to prove yourself to people.",
 "God will always bring the right people into your life, but you have to let the wrong people walk away.",
 "Successful people don't waste their time looking at what others are doing, they're too busy focusing on their own goals.",
 "Don't just accept whatever comes your way in life. You were born to win; you were born for greatness; you were created to be a champion in life.",
 "When you're really believing, when you're in peace, you're showing God by your actions that you trust Him.",
 "Do all you can to make your dreams come true.",
 "Indeed, it is as important to learn how to receive a blessing as it is to be willing to give one.",
 "You will never change what you tolerate.",
 "God doesn't require us to be perfect. All He asks is that we keep trying and taking steps to improve.",
 "Sometimes we're waiting for other people to change, but God is waiting for us to change.",
 "You're not defined by your past; you're prepared by it. You're stronger, more experienced, and you have greater confidence.",
 "What does it mean to have hope in the Word of God? It means that no matter what you may be facing, no matter where you may have been, no matter what anyone may have said, you can live in victory because you have a promise from Almighty God.",
 "The good news is that people don't determine your destiny; God does.",
 "The more people try to push you down, the higher God will take you. That's the way God is."
]