["All your life, you will be faced with a choice. You can choose love or hate... I choose love.",
"I wore black because I liked it. I still do, and wearing it still means something to me. It's still my symbol of rebellion -- against a stagnant status quo, against our hypocritical houses of God, against people whose minds are closed to others' ideas.",
"You build on failure. You use it as a stepping stone. Close the door on the past. You don't try to forget the mistakes, but you don't dwell on it. You don't let it have any of your energy, or any of your time, or any of your space.",
"My arms are too short to box with God.",
"There's a lot of things blamed on me that never happened. But then, there's a lot of things that I did that I never got caught at.",
"There's unconditional love there. You hear that phrase a lot but it's real with me and her [June Carter]. She loves me in spite of everything, in spite of myself. She has saved my life more than once. She's always been there with her love, and it has certainly made me forget the pain for a long time, many times. When it gets dark and everybody's gone home and the lights are turned off, it's just me and her.",
"Flesh and blood needs flesh and blood, and you're the one I need",
"There's no way around grief and loss: you can dodge all you want, but sooner or later you just have to go into it, through it, and, hopefully, come out the other side. The world you find there will never be the same as the world you left.",
"it's good to know who hates you and it is good to be hated by the right people",
"The beast in me. Is caged by frail and fragile bars.",
"You're so heavenly minded, you're no earthly good.",
"You build on failure. You use it as a stepping sone. Close the door on the past. You don't try to forget the mistakes, but you don't dwell on it. You don't let it have any of your energy, or any of your time, or any of your space.",
"Beneath the stains of time the feeling disappears, you are someone else I am still right here.",
"Sometimes I am two people. Johnny is the nice one. Cash causes all the trouble. They fight.",
"I wear the black for the poor and the beaten down, \nLivin' in the hopeless, hungry side of town, \nI wear it for the prisoner who has long paid for his crime,\nBut is there because he's a victim of the times. \nI wear the black for those who never read",
"I shot a man in Reno just to watch him die.",
"I'm not bitter. Why should I be bitter? I'm thrilled to death with life.",
"I love songs about horses, railroads, land, Judgment Day, family, hard times, whiskey, courtship, marriage, adultery, separation, murder, war, prison, rambling, damnation, home, salvation, death, pride, humor, piety, rebellion, patriotism, larceny, determination, tragedy, rowdiness, heartbreak and love. And Mother. And God.",
"Everybody was wearing rhinestones, all those sparkly clothes, and cowboy boots. I decided to wear a black shirt and pants and see if I could get by with it. I did and I've worn black clothes ever since.",
"I keep a close watch on this heart of mine \nI keep my eyes wide open all the time \nI keep the ends out for the tie that binds \nBecause you're mine, I walk the line.",
"They're powerful, those songs. At times they've been my only way back, the only door out of the dark, bad places the black dog calls home.",
"Backstage at the Grand Ole Opry, I got on my knees and told her that I was going to marry her some day. We were both married to someone else at the time.'Ring Of Fire'-June and Merle Kilgore wrote that song for me-that’s the way our love affair was. We fell madly in love and we worked together all the time, toured together all the time, and when the tour was over we both had to go home to other people. It hurt.",
"I love weather. I'm a connoisseur of weather. Wherever my travels take me, the first thing I do is turn on the weather channel and see what's going on, what's coming. I like to know about regional weather patterns, how storms are created in different altitudes, what kinds of clouds are forming or dissipating or blowing through, where the winds are coming from, where they've been. That's not a passion everybody shares, I know, but I don't believe there are any people on earth who, properly sheltered, don't feel the peace inside a summer rain and the cleansing it brings, the renewal of the earth in its aftermath.",
"This morning, with her, having coffee",
"So I simply don't buy the concept of Generation X as the lost generation. I see too many good kids out there, kids who are ready and willing to do the right thing, just as Jack was. Their distractions are greater, though. There's no more simple life with simple choices for the young.",
"I Walk the Line",
"I took the easy way, and to an extent I regret that. Still, though, the way we did it was honest. We played it and sang it the way we felt it, and there's a lot to be said for that.",
"The beer and the wurst were wonderful, but I was dying to be back in the South, where the livin' was easy, where the fish were jumpin', where the cotton grew high.",
"Six foot six he stood on the ground \nHe weighed two hundred and thirty-five pounds \nBut I saw that giant of a man brought down \nTo his knees by love",
"This business I'm in is different. It's special. The people around me feel like brothers and sisters. We hardly know each other, but we're that close; somehow there's been an immediate bonding between total strangers. We share each other's triumphs, and when one of us gets hurt, we all bleed - it's corny, I know, but it's true. I've never experienced anything like this before. It's great. It turns up the heat in life.",
"However, neither he nor anyone else could have become the star Elvis was. Ain't nobody like Elvis. Never was.",
"I have tried drugs and a little of everything else, and there iss nothing in the world more soul-satisfying than having the kingdom of God building inside you and growing.",
"I don't have Paul's calling - I'm not out there being all things to all men to win them for Christ - but sometimes I can be a signpost. Sometimes I can sow a seed. And post-hole diggers and seed sowers are mighty important in the building of the Kingdom.",
"Success is having to worry about every damn thing in the world, except money.",
"You can choose love or hate…I choose love.",
"And I'd be dead , but by God's grace \nDrive on, don't mean nothin' \nMy children love me, but they don't understand \nAnd I got a woman who knows her man \nDrive on, don't mean nothin', drive on",
"The only really frightening thing about Cinnamon Hill belongs in the realm of the living and serves to remind me that some of them-just a few of them, a tiny minority-are much more dangerous than all the dead put together.",
"Well you may throw your rock and hide your hand \nWorkin' in the dark against your fellow man \nBut as sure as God made black and white \nWhat's down in the dark will be brought to the light",
"Hardin wouldn't run.",
"If this were a movie I'd be the bad guy.",
"Trust gets you killed. Love gets you hurt. And being real gets you hated.",
"It's good to know who hates you, and it's good to be hated by the right people.",
"You build on failure. You use it as a stepping stone.",
"Let me tell you, Mr. teacher when you say you'll make me right, in five hundred years of fighting not one Indian turned white",
"Truth, said the Master, cannot be hid But he didn't say slap it in the face of my kids.",
"Well, I'd love to wear a rainbow everyday and tell the world that everything's okay / But I'll try to carry off a little darkness on my back / 'Til things are brighter, I'm the man in black.",
"That he would pause In his killing To go about the business Of preparing for the living Knowing That he will immediately return To the business of killing?"]